[
  {
    "bi_id": "PS-MFG-001",
    "name": "PRODUCTION PLANNING & SCHEDULING PROCESS",
    "area_name": "Manufacturing",
    "step_description": "This step focuses on using an integrated data model to comprehensively plan, simulate, and schedule the entire manufacturing process. The goal is to achieve fast time-to-market and ensure a reliable supply by optimizing resource allocation (materials, equipment, personnel), managing capacities, and reacting efficiently to changes across the product lifecycle, from launch to routine production.",
    "what_is_actually_done": "Performing operations planning (material, equipment, personnel), capacity planning (including test and tech validation), day-to-day planning, and integrated planning for maintenance, calibration, and changeovers. Simulating various production scenarios, scheduling production runs, and optimizing schedules considering material and equipment availability, capacity constraints, and required times. This includes re-planning due to contingencies and managing campaign planning (number of batches), shift planning, and launch planning. Utilizing a centralized planning tool (or tools like SAP APO, OR-Soft) that integrates data from various disciplines (SCM, Manufacturing, Engineering, CPT, Cleaning Validation) and production systems. This includes managing manufacturing lead times, Bills of Material (BOM), and equipment/system availability. Potentially using AI for demand forecasting to optimize production and warehousing, and analyzing historical production times for predictive planning. Aims for setup-optimized production planning. Simulating new plant layouts and operations to optimize building and facility utilization, supporting transfers and launches by modeling processes with attributes like parameters, equipment data, timelines, and capacity (M02).",
    "interfaces_text": "Supply Chain Management (SCM): Receives global SCM information (demand forecasts, production plans) as a prior process; interacts for replenishment planning, material availability, and MRP.\nMaintenance: Integrated planning of maintenance activities.\nEngineering (GFE): Planning for new buildings/facilities (plant modeling), equipment availability.\nQuality (QC/QA): Planning for cleaning validation, calibration.\nIT & GBS: For planning tool implementation, data integration, and standardized planning processes.\nInnovation Unit Development (IU Dev): For plant modeling and simulation for new product introductions and transfers.",
    "pain_points": "Decentralized planning in multiple Excel sheets; lack of a single, integrated tool.\nSlow and inefficient re-planning after production changes or unforeseen events.\nManual cross-checks required for maintenance, production, and material availability.\nDifficulties in scenario planning and simulation to check possible outcomes quickly.\nForecast data not directly integrated into planning systems.\nManual effort in transferring SCM's high-level plan to local detailed plans.\nComplex planning due to diverse products with different process/equipment requirements.\nLack of a central tool for detailed shop-floor scheduling (Feinplanung).\nInadequate tools for managing changeover data and optimizing changeover sequences.\nMissing central database for supplier material qualification.\nPlanning processes are not standardized or automatically networked with SCM.\nHigh manual effort in risk analysis for aseptic facilities (related to plant modeling)."
  },
  {
    "bi_id": "PS-MFG-002",
    "name": "MANUFACTURING PROCESSES",
    "area_name": "Manufacturing",
    "step_description": "This step encompasses the actual execution of production according to plan. It aims to drive efficiency and continuous improvement through automated, intelligent, and integrated processes covering commercial production, test/tech batches, product introduction, batch release, in-process controls (IPC/PAT), packaging, and intra-plant logistics.",
    "what_is_actually_done": "Conducting commercial production, test and technical batches, and new product introductions. Creating, managing, and executing digitally supported MBRs and master recipes, aiming for standardization, automated generation from templates, and a harmonized MBR library (M04). Automatically collecting and transferring data to/from equipment and IPC devices, ensuring vertical integration and harmonized data definitions (e.g., for draw, sample, analyze procedures) (M06). Monitoring process parameters in real-time using inline measurements and sensors, with dashboards and alerts for negative trends to enable early reaction and correction (M03). Using data simulation, AI, and machine learning to detect anomalies, identify potential process problems or equipment issues proactively during production, and support incident tackling (M08). Performing IPCs and leveraging PAT. Utilizing a unified data source/platform for IU Dev and Operations to assess process risks, define control strategies (FMEA, CSS), monitor product/process robustness, and enable a feedback loop from production to development (M05). Using AR for guiding operators/mechanics in tasks like troubleshooting, process execution (e.g., complex changeovers), setup, and identifying errors (M09). Collecting data relevant for batch release from the execution process (M07 related activities). Managing intra-plant logistics (including material introduction to lines) and packaging operations.",
    "interfaces_text": "Production Planning & Scheduling: Receives production orders and schedules.\nSupply Chain Management (SCM): For intra-plant logistics until handover to production.\nQuality Control (QC): For IPC sampling, lab analysis (though aiming to reduce with inline testing), and batch release data.\nQuality Assurance (QA): For MBR compliance, deviation management, and batch release oversight.\nEngineering (GFE) / Automation: For equipment integration, sensor implementation, and automation solutions.\nIT & GBS: For MES, LIMS, ERP integration, data platforms (Dataland), and MBR system support.\nInnovation Unit Development (IU Dev): For seamless drug product knowledge transfer, DoE, and FMEA.\nMaintenance: For equipment status and troubleshooting (supported by AR).",
    "pain_points": "System breaks and lack of harmonization in MBR design and execution across sites.\nManual data transfer between systems and equipment; lack of fully vertical integration.\nDelayed identification and reaction to negative process trends or anomalies.\nHigh manual effort in launches and transfers due to fragmented drug product knowledge.\nLack of a unified data source between IU Dev and Operations for product knowledge.\nDifficulties in accessing real-time, comprehensive data for troubleshooting and process optimization.\nInconsistent IPC practices and data collection.\nLimited use of PAT and inline measurements, leading to reliance on time-consuming lab analytics.\nSuboptimal equipment utilization due to unforeseen failures or disturbances.\nLanguage differences and varying factory designs hindering process harmonization.\nHigh effort for MBR creation and review; lack of automated generation and validation."
  },
  {
    "bi_id": "PS-MFG-003",
    "name": "CHANGE OVERS",
    "area_name": "Manufacturing",
    "step_description": "This step involves managing and executing all activities required to switch production from one product or batch to another. The focus is on minimizing downtime through transparent, automated, and digitally supported processes, including equipment setup, cleaning, sterilization, and conditioning.",
    "what_is_actually_done": "Performing the physical changeover process, including equipment set-up, cleaning (minor, major, cross-cleaning), sterilization, and conditioning of systems. Managing equipment ('Ausrüstung') and format parts required for changeovers. Using historical data, simulation (Digital Twin), and AI-supported operator guidance to analyze, optimize, and standardize changeover processes, including setup sequences and product sequence optimization (M10). Implementing automated testing (e.g., TOC analysis via inline sensors) and release procedures for cleaning processes, potentially with approval by exception (M11). Automatically loading recipes and machine settings onto equipment to reduce manual effort and errors (M12). Providing real-time visibility (e.g., via digital info boards) into the progress of changeover activities and any potential disruptions for operators, coaches, and team leads (M13).",
    "interfaces_text": "Production Planning & Scheduling: Receives changeover schedules and provides feedback on actual durations.\nManufacturing Processes: Precedes and follows the actual manufacturing of batches.\nQuality Control (QC): For cleaning validation, release of cleaned equipment (though aiming for automation).\nQuality Assurance (QA): Oversight of cleaning validation and changeover documentation.\nMaintenance: Involved in equipment setup, adjustments, and ensuring equipment readiness.\nEngineering (GFE) / Automation: For automation of settings, Digital Twin development for optimization.\nIT: For systems supporting live status tracking, Digital Twins, and automated recipe loading.",
    "pain_points": "Manual search for equipment and format parts.\nLack of clear visualization of where equipment needs to go or how it should be configured.\nChangeover information often tracked in Excel or based on empirical knowledge of shift leaders.\nNo standardized changeover procedures across all factories or for all equipment.\nProduction downtime due to necessary training on the machine during changeovers.\nFrequent and complex setups due to a high number of format parts.\nInefficient cleaning processes, especially manual processes in Pharma (sampling, analytics, release iterations) compared to automated processes in Bio.\nFixed cleaning volumes (e.g., water) used per SOP, irrespective of actual need.\nLack of real-time visibility into changeover progress and potential issues."
  },
  {
    "bi_id": "PS-MFG-004",
    "name": "EQUIPMENT & AUTOMATION LIFECYCLE PROCESS",
    "area_name": "Manufacturing",
    "step_description": "This step focuses on managing all equipment and automation solutions throughout their entire lifecycle, from design and specification to usage, maintenance, and retirement. The aim is to ensure transparency of equipment-related data (location, status, history, qualification) to enable efficient manufacturing and informed cross-functional decision-making.",
    "what_is_actually_done": "Defining user requirements specifications (URS), technical specifications (TS), and factory planning for operating equipment and automation solutions. Managing the process of how equipment is used and re-used throughout its lifecycle. Implementing systems (e.g., geo-localization with trackers, NFC/RFID, online dashboards) to provide real-time transparency on the location and status (e.g., clean, calibrated, in use) of movable equipment and format parts. This includes automated identification and cross-checks (M14). Establishing and maintaining a globally accessible database of all production equipment, including performance data, qualification documents (URS, IQ, OQ, PQ), modification history, and standards. This supports equipment standardization, facilitates transfers/launches, and enables AI-assisted information retrieval (M15). Driving standardization of equipment, vendors (where feasible), and qualification procedures to reduce variability and effort.",
    "interfaces_text": "Engineering (GFE): For equipment design, URS, factory planning, automation solutions, and maintenance planning.\nIT: For database implementation, tracking systems, and data integration.\nMaintenance: For equipment history, calibration status, and maintenance procedures.\nQuality Assurance (QA): For qualification documentation, equipment standards, and validation.\nProduction Planning & Scheduling: For information on equipment availability and status.\nManufacturing Processes: For actual usage of equipment and feedback on performance.\nProcurement: For new equipment purchases and supplier selection based on standards.\nSupply Chain Management (SCM): Potentially for tracking of large containers or inter-factory equipment movements.",
    "pain_points": "Different work processes and methods for demand management, validation, etc., between IT, GBS, GFE, and Business units.\nKnowledge management and best practices for equipment are highly person-dependent.\nLack of systematic tracking of equipment within factories (manual search).\nMedia breaks in engineering planning tools, limiting interoperability.\nVarying 'quality standards' for similar equipment across different sites.\nIncomplete or missing equipment history.\nScattered accountability for equipment lifecycle management.\nEquipment data (e.g., qualification status, performance) is not consistently or fully digitally available.\nEquipment is often managed disparately at each site (ordering, information, integration).\nDifficult to access and consolidate qualification data for equipment.\nManual and error-prone processes for tracking equipment and parts.\nSupplier selection processes do not sufficiently consider digital capabilities."
  },
  {
    "bi_id": "PS-MFG-005",
    "name": "PRODUCT, SITE, PROCESS DATA USAGE",
    "area_name": "Manufacturing",
    "step_description": "This step focuses on ensuring that process and product data are easily accessible to the right people at the right time and with the right quality. The aim is to leverage this data to generate insights for production robustness, performance improvement, continuous process verification, and efficient decision-making across the product lifecycle, including launches and transfers.",
    "what_is_actually_done": "Making production data (including data science insights, discrepancy management, data integrity information, and master batch records) available and usable. Using real-time data for Continuous Process Verification (CPV) and assessing 'Prozessrobustheit' (process robustness). Establishing feedback loops from manufacturing to IU (Innovation Unit Development) for continuous improvement. Using AI and real-time data pools to speed up deviation investigations and CAPA management, including seamless product traceability and automated summary creation (M16). Providing self-service data platforms (connected to Dataland) to enable business units to perform their own data analyses and evaluations, ensuring transparency of process, equipment, and product data (M17). Automatically preparing documentation for audits using production and quality data to reduce preparation time (M18). Using AI to automatically generate approval documents, such as registration documents, based on development and production data (MBRs, SOPs, etc.) (M19). Comparing IPC, lab data, and other process data across internal sites and CMOs for continuous process verification (Multi-Site-CPV), batch comparison, troubleshooting, and process optimization, leveraging AI where applicable (M20).",
    "interfaces_text": "Manufacturing Processes: Source of production data (IPC, equipment data, batch records).\nQuality Control (QC): Lab data, IPC data, data for deviation management.\nQuality Assurance (QA): Data for CPV, deviation/CAPA management, audit preparation, approval documents.\nInnovation Unit Development (IU Dev): For data exchange related to launches, transfers, process robustness, and feedback for product/process development.\nIT & GBS: For data platforms (Dataland, GDTS), MES, LIMS, data governance, and AI tool support.\nData Science Teams: For advanced analytics, process modeling, and AI-driven insights.\nRegulatory Affairs (RA): For automated creation of registration documents.\nCorporate Quality Audits & Inspection: For automated audit preparation.",
    "pain_points": "Lack of equipment standards, including interface definitions for data exchange.\nNo unified system for data analysis; data often siloed.\nUncertainty regarding data storage locations and inconsistent data quality.\nDifficulties in transferring data smoothly from launch to routine production phases.\nLimited mobile availability of data.\nMissing batch context for sensor trend data, hindering analysis.\nProcess modeling and mining are not yet fully utilized.\nCPV monitoring relies heavily on lab data from LIMS instead of real-time IPC/process data.\nData, knowledge, and best-practice sharing across sites is manual or non-existent.\nMaster data processes are not well-established to ensure high-quality master data.\nLimited use of AI for data-driven support and insights.\nLack of a digital data backbone for shared use of batch data between Product Development (IU) and Product Lifecycle Management (HPS).\nMissing tools for self-service data access and analysis by business users.\nManual and time-consuming preparation of audit and approval documents.\nInefficient deviation and CAPA management due to manual data collection and analysis."
  },
  {
    "bi_id": "PS-MFG-006",
    "name": "WORKPLACE & OPERATOR ASSISTANCE",
    "area_name": "Manufacturing",
    "step_description": "This step aims to empower employees by providing easy access to relevant knowledge, tools, and digitally supported learning processes. The goal is to enable them to upskill independently, work efficiently and safely, and make informed decisions, supported by AI and digital assistance where appropriate.",
    "what_is_actually_done": "Providing tools and processes for managing and accessing knowledge, including SOPs, MBRs, technical documentation, and training materials. Managing employee qualifications and providing training, including shift planning and leveraging digital tools like AR/VR. Providing clear guidance for manufacturing operations through SOPs, MBRs, etc. Implementing automated process and equipment alerts for exception-based intervention. Implementing digital onboarding plans with role-based assignment of training and SOPs, flexible interfaces for individual plan adjustment, and digital signatures (M21). Providing real-time, overarching translation for manufacturing information to overcome language barriers, potentially integrated into systems like MES or via tools like Copilot (M22). Establishing a global database or dashboard for reliable identification of supplier qualification data (e.g., which raw/packaging material is qualified for which product at which site) (M23). Providing AI-powered assistance (e.g., Process CoPilot, Q&A tools) for operators to quickly find information in SOPs/MBRs, understand processes, get context-sensitive support, and manage incidents (M24). Using AI to support knowledge management through tools like AI-powered Q&A for SOPs, GenAI for finding answers, digital logbooks, and SOP knowledge graphs for visualizing hierarchies and contexts (M25).",
    "interfaces_text": "Human Resources (HR): For onboarding processes, training programs, and qualification management (e.g., BI University).\nQuality Assurance (QA): For SOP management, training records, GMP compliance, and supplier qualification.\nManufacturing Processes: Operators interact with these systems during their daily work.\nIT & GBS: For digital tool implementation (AR/VR, AI assistants, translation tools, knowledge platforms, MES interfaces like Veeva Vault).\nEngineering (GFE): For technical documentation and equipment-related knowledge.\nProcurement/Supply Chain Management (SCM): For supplier qualification data.\nCompliance: For ensuring GxP compliance of digital tools and translated information.",
    "pain_points": "Multiple unaligned VR training projects across sites.\nLong onboarding times for new employees and high workload/fluctuation rates.\nAlerts from different systems are not aggregated or easily accessible.\nMissing interface between Veeva Vault and MES for integrated display of SOPs during shop floor onboarding.\nToo many SOPs, making MA onboarding lengthy and inefficient.\nLack of fully integrated VR/AR glasses for training and operational support.\nErgonomically challenging processes.\nLimited AI support for manufacturing staff.\nDifficulty in efficiently reading and understanding numerous SOPs; information is not readily available.\nCritical knowledge is often concentrated within a small group of experts.\nLanguage barriers in a global environment.\nDifficult access to reliable, centralized information on supplier qualifications.\nChallenges in accessing and utilizing dispersed knowledge effectively."
  }
]