[
  {
    "bi_id": "PM-UC-01",
    "name": "One holistic performance management approach",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-01",
    "priority": null,
    "raw_content": null,
    "summary": "One holistic performance management approach with one source-of-truth cascading Our Priorities to team or individual targets and setting clear goals; visibility of upper targets. Harmonized & standardized methodology to break down strategic goals. Transparency on how each KPI contributes to each target and goal/ strategic objective on the next upper level. One Performance Monitoring Tool / Dashboard across BI",
    "inspiration": null,
    "wave": "Wave 1",
    "effort": "Medium",
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Use of multiple tools for performance management, leading to inefficiencies and lack of integration. Parallel breakdown of strategic targets resulting in more than one set of priorities within the organisation. Misalignment between individual and organizational goals",
    "TARGET / SOLUTION DESCRIPTION": "One holistic performance management approach with one source-of-truth cascading Our Priorities to team or individual targets and setting clear goals; visibility of upper targets. Harmonized & standardized methodology to break down strategic goals. Transparency on how each KPI contributes to each target and goal/ strategic objective on the next upper level. One Performance Monitoring Tool / Dashboard across BI",
    "TECHNOLOGIES": "ONE system for goals / targets and KPIs -> connection between KPIs and goals they contribute to. One electronic template in all organisation units to breakdown targets and setting goals",
    "REQUIREMENTS": "Breaking down goals and setting targets. Standardized breakdown methodology",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Connect long-term orientation and agile response capability (strategy - key results - KPI (measure&analyze). Smart and consistent target cascading. One holistic performance management approach with one source-of-truth cascading Our Priorities to team or individual targets and setting clear guardrails. Standardized breakdown: Use one electronic template in all organisation units to breakdown targets and setting goals. Common understanding of the dimensions",
    "Further ideas/ input (Stickers, pictures, files, ...)": null,
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null. Initial evaluation: Medium",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null. Initial evaluation: High",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-02",
    "name": "Break-down tool for strategic goals (transparent goal tree)",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-01",
    "priority": null,
    "raw_content": null,
    "summary": "IT Tool supporting standardized breakdown: One holistic performance management approach with one source-of-truth cascading Our Priorities to team or individual targets and setting clear goals; visibility of upper targets. Standardised approach to define and measure roadmaps for strategy implementation. Hoshin Kanri methodology in a standard software solution which incl. Savings tracker. Transparency on how each KPI contributes to each target and goal/ strategic objective on the next upper level",
    "inspiration": null,
    "wave": "Wave 1",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Each function develops different roadmaps not comparable or measurable. No aggregated roadmap towards our 2035 goal. Not all initiatives / actions are cascaded through the relevant teams precisely. Parallel breakdown of strategic targets resulting in more than one set of priorities within the organisation. Misalignment between individual and organizational goals",
    "TARGET / SOLUTION DESCRIPTION": "IT Tool supporting standardized breakdown: One holistic performance management approach with one source-of-truth cascading Our Priorities to team or individual targets and setting clear goals; visibility of upper targets. Standardised approach to define and measure roadmaps for strategy implementation. Hoshin Kanri methodology in a standard software solution which incl. Savings tracker. Transparency on how each KPI contributes to each target and goal/ strategic objective on the next upper level",
    "TECHNOLOGIES": "System supported standardized approach for breaking down strategic objectives to targets per department. Smart and connected goal cascading",
    "REQUIREMENTS": "Breaking down goals and setting targets. Business Case Tracker (e.g. expected savings of Project A x EUR in y sites --> track if these targets have been reached). Communication tool",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Visibility of targets of higher levels. Possibility to drill up/down between different levels of goals / targets. Each goal or target must be aligned and connected to the corresponding higher-level objective. System supported standardized approach for breaking down strategic objectives to targets per department. Smart and connected goal cascading",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Business Case Tracker (e.g. expected savings of Project A x EUR in y sites --> track if these targets have been reached). Communication tool",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null. Initial evaluation: null",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null. Initial evaluation: null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-03",
    "name": "AI supported knowledge graph tool for identifying dependant or conflicting targets and goals",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-01",
    "priority": null,
    "raw_content": null,
    "summary": "AI supported consolidation of individual targets and gap assessment vs. strategic goals. AI supported automatic translation of strategic goals into targets for individual areas (from top level to shop level). Overview over goals/targets of different departments with important interfaces is available with connection to own goals. System warns if goals/targets are contradictive. System shows dependences of goals in order to derive mutual measures to reach goals",
    "inspiration": null,
    "wave": "Wave 1",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Goals and targets of other departments are not communicated and not transparent. Connection between goals/targets are not visible and cannot be set into relation to each other and not to goals from above. No visualization of targets is available",
    "TARGET / SOLUTION DESCRIPTION": "AI supported consolidation of individual targets and gap assessment vs. strategic goals. AI supported automatic translation of strategic goals into targets for individual areas (from top level to shop level). Overview over goals/targets of different departments with important interfaces is available with connection to own goals. System warns if goals/targets are contradictive. System shows dependences of goals in order to derive mutual measures to reach goals",
    "TECHNOLOGIES": "Kind of Knowledge graph which show the dependencies of the Goals. Electronic tool for breakdown links to OneOps strategic targets to make focus and interdependencies transparent. AI supported knowledge graph tool",
    "REQUIREMENTS": "Breaking down goals and setting targets. Target breakdown tool with goal overview must be available (use case 02)",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": "n/a",
    "REDUCTION TIME FOR PRODUCT LAUNCHES": "n/a",
    "REDUCTION OF TOTAL COSTS OF SUPPLY": "Impact if contradicting goals exist",
    "QUALITY IMPROVEMENT": "This helps to understand if goals are connected to reduce contradicting measures",
    "Original notes from ideation": "Kind of Knowledge graph which show the dependencies of the Goals. Electronic tool for breakdown links to OneOps strategic targets to make focus and interdependencies transparent. Co-dependencies of goals: Make goals for every employee transparent to enable more effective collaboration on goals or highlight conflicting goals. AI supported consolidation of individual targets and gap assessment vs. strategic goals",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Target breakdown tool with goal overview must be available (use case 02)",
    "Effort description & quantification": "Operating cost (Opex): Software as a service. Invest (Capex): Cost for IT implementation. Implementation time: null. Initial evaluation: null",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: n/a. REDUCTION OF TIME FOR PRODUCT LAUNCH: n/a. REDUCTION OF TOTAL COSTS OF SUPPLY: Impact if contradicting goals exist. QUALITY (RFT): This helps to understand if goals are connected to reduce contradicting measures. Initial evaluation: null",
    "Redundancies & Dependencies": "Target breakdown tool with goal overview must be available (use case 02)",
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-06",
    "name": "Automized target and KPI baseline review tool",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-02",
    "priority": null,
    "raw_content": null,
    "summary": "Automized yearly review of KPI baseline if it is still appropriate including targets. Regular KPI check process by ensuring all metrics are relevant. Dynamic KPI targets",
    "inspiration": null,
    "wave": "Wave 1",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Need for regular review of KPI baselines to ensure they remain appropriate. Ensuring all metrics are relevant and up-to-date",
    "TARGET / SOLUTION DESCRIPTION": "Automized yearly review of KPI baseline if it is still appropriate including targets. Regular KPI check process by ensuring all metrics are relevant. Dynamic KPI targets",
    "TECHNOLOGIES": "There is no global solution needed because it can be considered in dashboarding",
    "REQUIREMENTS": "Breaking down goals and setting targets. KPI tree",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Automized yearly review of KPI baseline if it is still appropriate including targets. Regular KPI check process by ensuring all metrics are relevant",
    "Further ideas/ input (Stickers, pictures, files, ...)": "KPI tree",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null. Initial evaluation: null",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null. Initial evaluation: null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-17_A",
    "name": "Countermeasure impact and effectiveness tracker",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-02",
    "priority": null,
    "raw_content": null,
    "summary": "AI support to allocate the corresponding KPI out of the BI KPI landscape or even propose additional KPIs if needed - considering the level of aggregation (smart&consistent cascading). System supported translation of targets into concrete figures and KPIs for each individual area. KPI must be directly linked to a specific (strategic / tactical) goal and its action its quantitative upper/lower limit must be standardized across departments/units. Limitation of number of targets per organizational level (the higher the less). ONE system for KPIs that limits maximum number of KPI's (e.g. 20) must include human outside the system. Quality gate (check) to ensure purpose of a KPI. Linkage of KPIs to targets and of targets to goals",
    "inspiration": null,
    "wave": "Wave 1",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "No standardized tool to measure effectiveness of countermeasures/actions. Action \"effectiveness check\" incl. timeline defined and linked to respective KPI/goal. Automated assessment of effectiveness in regards to time to resolution, reoccurrence, sustainable improvement of respective KPI or Business Goal",
    "TARGET / SOLUTION DESCRIPTION": "AI support to allocate the corresponding KPI out of the BI KPI landscape or even propose additional KPIs if needed - considering the level of aggregation (smart&consistent cascading). System supported translation of targets into concrete figures and KPIs for each individual area. KPI must be directly linked to a specific (strategic / tactical) goal and its action its quantitative upper/lower limit must be standardized across departments/units. Limitation of number of targets per organizational level (the higher the less). ONE system for KPIs that limits maximum number of KPI's (e.g. 20) must include human outside the system. Quality gate (check) to ensure purpose of a KPI. Linkage of KPIs to targets and of targets to goals",
    "TECHNOLOGIES": "System support to find the right KPI which supports reaching the according target. KPI automated guide for connecting KPIs to Goals. Link KPI's to relevant strategic targets to make focus and potential conflicts transparent",
    "REQUIREMENTS": "KPI Definition & Cascading. Accept that a quantitative KPI can't always reflect complexity of qualitative goals/strategy",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": "Setting in time countermeasures without delays in transfer timeline",
    "REDUCTION TIME FOR PRODUCT LAUNCHES": "Setting in time countermeasures without delays in launch timeline",
    "REDUCTION OF TOTAL COSTS OF SUPPLY": "Impact if contradicting goals exist",
    "QUALITY IMPROVEMENT": "This helps to understand if goals are connected to reduce contradicting measures",
    "Original notes from ideation": "System support to find the right KPI which supports reaching the according target. KPI automated guide for connecting KPIs to Goals. Link KPI's to relevant strategic targets to make focus and potential conflicts transparent. Accept that a quantitative KPI can't always reflect complexity of qualitative goals/strategy. Tool to measure efficiency of measures with regard to gap closing. AI-based robustness check of actions. AI-based check of CAPA effectiveness. Continuous evaluation of countermeasures effectiveness",
    "Further ideas/ input (Stickers, pictures, files, ...)": "One target system (see picture). Countermeasures and effectiveness must be in the same system/module. Service Now? Trackwise similar to MAG Tool in Successfactor. Efficient performance steering process. Robustness increase. Reduction of costs (e.g. functional costs)",
    "Effort description & quantification": "Operating cost (Opex): Depends on system, licenses cost may arise. Invest (Capex): No Capex, but initial IT Budget. Implementation time: null. Initial evaluation: Medium",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: Setting in time countermeasures without delays in transfer timeline. REDUCTION OF TIME FOR PRODUCT LAUNCH: Setting in time countermeasures without delays in launch timeline. REDUCTION OF TOTAL COSTS OF SUPPLY: No delay in production plan => reduced risk for idle costs. QUALITY (RFT): No additional costs due to insufficient actions implemented. Initial evaluation: High",
    "Redundancies & Dependencies": "Countermeasures need to be in same tool as the effectiveness tracker",
    "Contact persons for further detailing": "Neves,Filipe Oliveira. Business: Lyse Wotschke, Britta Lifka. GBS MDM (Martin Treder).",
    "Related ongoing projects (incl. contact person)": "COPE replacement - PACE Workstream. COPE - Rene Kluiber ext. Version Stream. Bernhard Poll. Britta Lifka. Martin Treder MDM. BIPRISMA Replacement. MDG: Sabine Germeyer / Boris Klockow."
  },
  {
    "bi_id": "PM-UC-08",
    "name": "KPI Definition & Cascading",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-02",
    "priority": null,
    "raw_content": null,
    "summary": "Tool for KPI overview, calculation and connecting (incl. KPI Handbook). Smart and connected KPI tree pool. Standardized KPI framework for individual areas/functions. Systems for calculating KPIs ensuring consistent calculation and enabling easy drill down and aggregation. KPI Database: find KPIs, their definition and similar KPIs with KPI Playbook/Definition always linked with the specific dashboard",
    "inspiration": null,
    "wave": "Wave 1",
    "effort": "Easy",
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Same KPI is calculated and/or interpreted in various ways in different areas. KPI dependencies are not clear or visualized. No structured overview of performance relevant KPIs across BI. No legacy system available for KPI management",
    "TARGET / SOLUTION DESCRIPTION": "Tool for KPI overview, calculation and connecting (incl. KPI Handbook). Smart and connected KPI tree pool. Standardized KPI framework for individual areas/functions. Systems for calculating KPIs ensuring consistent calculation and enabling easy drill down and aggregation. KPI Database: find KPIs, their definition and similar KPIs with KPI Playbook/Definition always linked with the specific dashboard",
    "TECHNOLOGIES": "Knowledge graph which shows the dependencies of the KPIs. Connected KPI-Tree Database. Digital and automated format for KPI logic and interaction. Drag and drop systematic from a KPI lake",
    "REQUIREMENTS": "Common understanding, cross functional exchange, employee acceptance via reduced efforts and clarity. Top down commitment by upper mgmt (no exceptions). Accept to develop from green field a new \"system\" (solution) - disruptive, ignore legacy approach. Connection to KPI lake (and dashboard) required. End-to-end transparency",
    "RELEVANTS": "All areas/functions across the organization",
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "KPI Database: find KPIs, their definition and similar KPIs. KPI Playbook/Definition always linked with the specific dashboard. Kind of Knowledge graph which shows the dependencies of the KPIs. Tool for KPI overview, calculation and connecting (incl. KPI Handbook). Make KPIs compatible to benchmarks BI is participating (e.g. POBOS). Use established templates (SCOR-Model from APICS). Possibility to drill up/down between different levels of KPIs. Establish clear rules and standards for defining KPIs. Connected KPI-Tree Database easy accessible. KPI definitions and correlation to level above. Where does the key figure contribute to the effect of higher-level reporting? A specific KPI is clearly defined (calculation formula) including upper/lower limits for the entire organization. KPI logic and their interaction is available in a digital and automated format. Drag and drop systematic from a KPI lake. KPIs can be aggregated to higher-level KPIs or vice versa. KPIs are clearly linked in both direction (KPI hierarchy and horizontal). KPI calculation reflects area specific value stream. End user has simple system access and a user friendly application experience (way of working). \"House of Performance\" reflects and connects Strategy via Goals/Targets to KPIs across all levels. Each area is using a KPI portfolio which was selected/guided by the KPI handbook and by that it is ensure that comparable areas apply the same KPIs. Leading and execution by example (all leader levels). Top down commitment by upper mgmt (no exceptions). Accept to develop from green field a new \"system\" (solution) [disruptive, ignore legacy approach]. Connection to KPI lake (and dashboard) required. No legacy system available. Common understanding, cross functional exchange, employee acceptance via reduced efforts and clarity. End-to-end transparency",
    "Further ideas/ input (Stickers, pictures, files, ...)": null,
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null. Initial evaluation: Easy",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null. Initial evaluation: High",
    "Redundancies & Dependencies": "Breaking down silos/barriers and increase transparency (mentioned in related area)",
    "Contact persons for further detailing": "Christina Frossert. Birgit Wärner. OneOps Ex. Exc. & Standard.",
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-10",
    "name": "Monitoring & Performance Dialogues",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-03",
    "priority": null,
    "raw_content": null,
    "summary": "Target Achievement Cockpit for Goal Monitoring. Automated daily/monthly/annual target achievement cockpit. Connected to action tracker (19) + good system to translate goals to targets and future oriented KPIs (1)",
    "inspiration": null,
    "wave": "Wave 1",
    "effort": "Medium",
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Lack of automated target achievement tracking. Manual monitoring of goal achievement across different time periods. Disconnected monitoring systems without integration to action tracking",
    "TARGET / SOLUTION DESCRIPTION": "Target Achievement Cockpit for Goal Monitoring. Automated daily/monthly/annual target achievement cockpit. Connected to action tracker (19) + good system to translate goals to targets and future oriented KPIs (1)",
    "TECHNOLOGIES": "Automated cockpit system. Integration with action tracking systems. KPI translation and monitoring tools",
    "REQUIREMENTS": "Integration with existing KPI systems. Connection to action tracker systems. Automated reporting capabilities",
    "RELEVANTS": "All areas requiring performance monitoring",
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Target Achievement Cockpit for Goal Monitoring. Connected to action tracker (19) + good system to translate goals to targets and future oriented KPIs (1). Automated daily/monthly/annual target achievement cockpit. Also connected to 2",
    "Further ideas/ input (Stickers, pictures, files, ...)": null,
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null. Initial evaluation: Medium",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null. Initial evaluation: null",
    "Redundancies & Dependencies": "Connected to action tracker (19). Good system to translate goals to targets and future oriented KPIs (1). Also connected to 2. Partners, suppliers, stakeholders involvement mentioned",
    "Contact persons for further detailing": "Marinie? (tentative contact mentioned)",
    "Related ongoing projects (incl. contact person)": "Action tracker (19). KPI translation system (1). Connection to use case 2"
  },
  {
    "bi_id": "PM-UC-11",
    "name": "One Performance Monitoring Tool / Dashboard concept across BI",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-03",
    "priority": null,
    "raw_content": null,
    "summary": "ONE Performance Monitoring Tool/System instead of silo solutions. Only one harmonized KPI Monitoring system applied in OneOps. One standard system for Performance Dialogue on each level with automated data available. Connected dashboards with the required information for each target group (e.g. senior management, site managers,...). One user-friendly and standardized dashboard with customized views (e.g. for OneOps Leadership, Network, Factory etc.). Frequencies and scope of each hierarchy is aligned (cascade & interlinked). ONE system as base for all dashboards & reports (instead of silo solutions) creating overall transparency",
    "inspiration": null,
    "wave": "Wave 1",
    "effort": "Medium",
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Missing linkage between different dashboard levels - management view vs. detail view. Individual not connected Dashboards for the different levels. Inconsistent reporting, limited visibility, misaligned metrics, and communication gaps. No comprehensive view of performance across the organization due to fragmented systems. Varied methods or tools for reporting, resulting in inconsistent formats and interpretations. Organization uses multiple performance management dashboards/tool using different software that does not allow structured automated integration of data and lacks transparency/connection. There is not ONE Business Case / Savings tracker across OneOps",
    "TARGET / SOLUTION DESCRIPTION": "ONE Performance Monitoring Tool/System instead of silo solutions. Only one harmonized KPI Monitoring system applied in OneOps. One standard system for Performance Dialogue on each level with automated data available. Connected dashboards with the required information for each target group (e.g. senior management, site managers,...). One user-friendly and standardized dashboard with customized views (e.g. for OneOps Leadership, Network, Factory etc.). Frequencies and scope of each hierarchy is aligned (cascade & interlinked). ONE system as base for all dashboards & reports (instead of silo solutions) creating overall transparency",
    "TECHNOLOGIES": "Open-minded visualization solution \"dashboard\". Standardized dashboards and data model across the organization. Data driven KPI monitor that predicts which target will likely be reached or missed by the end of a certain reporting period. DATALAND as Data integration Platform for a harmonized data foundation. Service Now?",
    "REQUIREMENTS": "Ensure standardized deployment in all functions of OneOps (or even beyond). Data from all relevant sources is seamlessly connected through standardized systems and available in real time enabling smooth flexible analysis and decision-making across all levels. ONE system as base for all dashboards & reports. Automated data generation & connection between levels",
    "RELEVANTS": "All OneOps functions and levels. Senior management, site managers, OneOps Leadership, Network, Factory etc.",
    "REDUCTION TIME FOR PRODUCT TRANSFER": "Not quantified (Alignment of targets and issue solving will support all target achievements, i.e. ensures faster transfers)",
    "REDUCTION TIME FOR PRODUCT LAUNCHES": "Not quantified (Alignment of targets and issue solving will support faster launches)",
    "REDUCTION OF TOTAL COSTS OF SUPPLY": "Not quantified (Alignment of targets and issue solving will support seamless supply)",
    "QUALITY IMPROVEMENT": "Not quantified (Performance management KPIs will be defined to support the achievement of these targets)",
    "Original notes from ideation": "Missing linkage between different dashboard levels - management view vs. detail view. Only one harmonized KPI Monitoring system applied in OneOps. ONE Performance Monitoring Tool/System instead of silo solutions. One standard system for Performance Dialogue on each level with automated data available. Frequencies and scope of each hierarchy is aligned (cascade & interlinked). ONE system as base for all dashboards & reports (instead of silo solutions) creating overall transparency. There is not ONE Business Case / Savings tracker across OneOps. Organization uses multiple performance management dashboards/tool using different software that does not allow structured automated integration of data and lacks transparency/connection. Individual not connected Dashboards for the different levels. Inconsistent reporting, limited visibility, misaligned metrics, and communication gaps. No comprehensive view of performance across the organization due to fragmented systems. Varied methods or tools for reporting, resulting in inconsistent formats and interpretations. Open-minded visualization solution \"dashboard\". Only one harmonized KPI Monitoring system applied in OneOps that ensures automated data generation & connection between levels. Connected dashboards with the required information for each target group (e.g. senior management, site managers,...). One user-friendly and standardized dashboard with customized views (e.g. for OneOps Leadership, Network, Factory etc.). Ensure standardized deployment in all functions of OneOps (or even beyond). Data from all relevant sources is seamlessly connected through standardized systems and available in real time enabling smooth flexible analysis and decision-making across all levels. e.g. DATALAND as Data integration Platform for a harmonized data foundation. Service Now?",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Standardized dashboards and data model across the organization. Data driven KPI monitor predicts which target will likely be reached or missed by the end of a certain reporting period",
    "Effort description & quantification": "Operating cost (Opex): Software as a service cost, Running cost via key user, personnel cost for performance dialogues. Invest (Capex): Cost for IT implementation. Implementation time: e.g. via Opex Prime roll-out (2 - 3 years?), depending on priority. Initial evaluation: Medium",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: Alignment of targets and issue solving will support all target achievements, i.e. ensures faster transfers. REDUCTION OF TIME FOR PRODUCT LAUNCH: Alignment of targets and issue solving will support faster launches. REDUCTION OF TOTAL COSTS OF SUPPLY: Alignment of targets and issue solving will support seamless supply. QUALITY (RFT): Performance management KPIs will be defined to support the achievement of these targets. Initial evaluation: High",
    "Redundancies & Dependencies": "Alignment of targets and issue solving will support all target achievements, i.e. ensures faster transfers, launches & seamless supply",
    "Contact persons for further detailing": "Marinie",
    "Related ongoing projects (incl. contact person)": "OPEX Prime"
  },
  {
    "bi_id": "PM-UC-12",
    "name": "Proactive Trending & Alerting System",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-04",
    "priority": null,
    "raw_content": null,
    "summary": "Escalation/Alerting System. Identification of trends, deviations (gaps vs. targets), risks & opportunities. Early warning system for proactive problem prevention incl. e.g. data from one unit might negatively impact another unit. Data driven KPI monitor predicts which target will likely be reached or missed by the end of a certain reporting period. Forecasting of KPIs/target achievements (forward looking KPIs). Automated escalation notification. Data-driven, automated identification of risks and opportunities. Correlation/dependencies monitoring. Dynamic and real time performance path calculation. Forward looking analysis and discussions",
    "inspiration": null,
    "wave": "Wave 1",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "No prewarning that targets/KPIs will not be reached. No warning system regarding upcoming issues. No automated alerts are triggered by predefined thresholds to notify stakeholders when targets are at risk. Lack of early warning system for proactive problem prevention",
    "TARGET / SOLUTION DESCRIPTION": "Escalation/Alerting System. Identification of trends, deviations (gaps vs. targets), risks & opportunities. Early warning system for proactive problem prevention incl. e.g. data from one unit might negatively impact another unit. Data driven KPI monitor predicts which target will likely be reached or missed by the end of a certain reporting period. Forecasting of KPIs/target achievements (forward looking KPIs). Automated escalation notification. Data-driven, automated identification of risks and opportunities. Correlation/dependencies monitoring. Dynamic and real time performance path calculation. Forward looking analysis and discussions",
    "TECHNOLOGIES": "KPI trending limits / alarm limits defined to initiate (preventive) continuous improvement actions. IT Tool for identification of trends, deviations (gaps vs. targets), risks & opportunities. Use AI to identify trends and create early alerts. KPI Thresholds/limits defined and transparent to trigger mitigation actions. Data driven KPI monitor that predicts target achievement",
    "REQUIREMENTS": "In CSI we already have two clearly defined thresholds for process parameters: Alarm Limit - Watch KPI trend more closely, Action Limit - Now you have to take action. KPI Thresholds/limits defined and transparent to trigger mitigation actions. Integration with existing monitoring systems. Real-time data connectivity",
    "RELEVANTS": "All areas with KPI monitoring requirements. CSI (Continuous System Improvement)",
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Escalation/Alerting System. Identification of trends, deviations (gaps vs. targets), risks & opportunities. In CSI we already have two clearly defined thresholds for process parameters: Alarm Limit - Watch KPI trend more closely, Action Limit - Now you have to take action. Early warning system for proactive problem prevention incl. e.g. data from one unit might negatively impact another unit. KPI trending limits / alarm limits defined to initiate (preventive) continuous improvement actions. Data driven KPI monitor predicts which target will likely be reached or missed by the end of a certain reporting period. Forecasting of KPIs/target achievements (forward looking KPIs). Automated escalation notification. No prewarning that targets/KPIs will not be reached. No warning system regarding upcoming issues. No automated alerts are triggered by predefined thresholds to notify stakeholders when targets are at risk. Data-driven, automated identification of risks and opportunities. Correlation/dependencies monitoring. Dynamic and real time performance path calculation. Forward looking analysis and discussions. KPI Thresholds/limits defined and transparent to trigger mitigation actions. Data driven KPI monitor predicts which target will likely be reached or missed by the end of a certain reporting period. Use AI to identify trends and create early alerts. IT Tool for identification of trends, deviations (gaps vs. targets), risks & opportunities",
    "Further ideas/ input (Stickers, pictures, files, ...)": null,
    "Effort description & quantification": "Operating cost (Opex): Software as a service cost. Invest (Capex): Cost for IT implementation. Implementation time: null. Initial evaluation: null",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null. Initial evaluation: null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-13",
    "name": "What-Now-Analyzer of KPIs",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-04",
    "priority": null,
    "raw_content": null,
    "summary": "Conclusion and action focused dashboards ('so what' instead of a collection of KPIs and graphs only) - supported by AI. What-Now-Analyzer of KPIs. Executive summary pre-drafted. Helps in faster decision-making, more efficient meetings and eventually faster problem fixing",
    "inspiration": null,
    "wave": "Wave 1",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Dashboards show graphs and numbers but lack conclusion \"the so-what message\". Collection of KPIs and graphs without clear action orientation. Inefficient decision-making and meetings due to lack of conclusive insights. Slower problem fixing due to missing actionable insights",
    "TARGET / SOLUTION DESCRIPTION": "Conclusion and action focused dashboards ('so what' instead of a collection of KPIs and graphs only) - supported by AI. What-Now-Analyzer of KPIs. Executive summary pre-drafted. Helps in faster decision-making, more efficient meetings and eventually faster problem fixing",
    "TECHNOLOGIES": "AI-supported analysis and conclusion generation. Large language models. Interlinked systems integration (e.g. CPV trending, other governance meetings)",
    "REQUIREMENTS": "Integration with existing KPI systems. AI/ML capabilities for analysis and conclusion generation. Connection to various governance systems. Comments interlinked to other systems e.g. CPV trending, other governance meetings",
    "RELEVANTS": "All areas using KPI dashboards and performance monitoring. Management and decision-making levels",
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Conclusion and action focused dashboards ('so what' instead of a collection of KPIs and graphs only) - supported by AI. Comments interlinked to other systems e.g. CPV trending, other governance meetings. Dashboards show graphs and numbers but lack conclusion \"the so-what message\". It helps in faster decision-making, more efficient meetings and eventually faster problem fixing. Executive summary pre-drafted. Conclusion and action focused dashboards ('so what' instead of a collection of KPIs and graphs only) - supported by AI. Executive summary pre-drafted",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Interlinked systems e.g. CPV trending, other governance meetings. Large language models",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null. Initial evaluation: null",
    "Redundancies & Dependencies": "Interlinked systems e.g. CPV trending, other governance meetings. Dependency on AI/ML infrastructure and capabilities",
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": "CPV trending systems. Other governance meetings systems"
  },
  {
    "bi_id": "PM-UC-14",
    "name": "KPI-Lake with raw data access",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-E01",
    "priority": null,
    "raw_content": null,
    "summary": "KPI-Lake with raw data access. enabler for Monitoring & Performance Dialogues",
    "inspiration": null,
    "wave": "Wave 3",
    "effort": "Medium",
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Access to raw/basis data in data lake for detailed analysis and improvement projects. KPI-Lake: Easy way to add KPI to individual monitoring use cases. All data in one place",
    "TARGET / SOLUTION DESCRIPTION": "KPI-Lake with raw data access. enabler for Monitoring & Performance Dialogues",
    "TECHNOLOGIES": "Connected to use case 8",
    "REQUIREMENTS": null,
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Access to raw / basis data in data lake for detailed analysis and improvement projects. KPI-Lake: Easy way to add KPI to individual monitoring use cases. All data in one place",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Info: KPI lake see #8. Info: Data lake see #20",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "Initial evaluation: High. REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": "Connected to use case 8. Related to KPI lake (see #8). Related to Data lake (see #20)",
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": "Connected to use case 8. KPI lake project (#8). Data lake project (#20)"
  },
  {
    "bi_id": "PM-UC-15",
    "name": "PurposeFit Dashboards",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-E01",
    "priority": null,
    "raw_content": null,
    "summary": "Automatically updated KPI Dashboard with possibility to switch between level - management views vs. detail views. Flexible Dashboards with multiple views. Standardized Template-Dashboards that allow adaptation for specific cases. One dashboard solution for similar functions (instead of reinventing the wheel again and again) e.g., QC PD. Audience and purpose specific visualization & read out (interconnected)",
    "inspiration": null,
    "wave": "Wave 3",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "No unified system for dashboarding. Dashboards are not standardized, everybody develops their own solutions. Updates of dashboards are often done manually before meetings, not automatically populated with data. Dashboards are often too generic, can't be adjusted based on audience or issue at hand. High Recurrency Rate of Defects, Deviations, ... because the drivers of performance are not fully understood/root-causes not known",
    "TARGET / SOLUTION DESCRIPTION": "Automatically updated KPI Dashboard with possibility to switch between level - management views vs. detail views. Flexible Dashboards with multiple views. Standardized Template-Dashboards that allow adaptation for specific cases. One dashboard solution for similar functions (instead of reinventing the wheel again and again) e.g., QC PD. Audience and purpose specific visualization & read out (interconnected)",
    "TECHNOLOGIES": "PowerBI, Tableau, etc. Service Now. Global solution",
    "REQUIREMENTS": "Templates need to be discussed and created. KPI-Standards and KPI tree. Easy connection to underlying data to get fast insights into the foundational data. Data and KPI-Lake",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Audience and purpose specific visualization & read out (interconnected). One dashboard solution for similar functions (instead of reinventing the wheel again and again) e.g., QC PD. Automatically updated KPI Dashboard with possibility to switch between level - management views vs. detail views. No unified system for dashboarding. Dashboards are not standardized, everybody develops their own solutions. Updates of dashboards are often done manually before meetings, not automatically populated with data. Dashboards are often too generic, can't be adjusted based on audience or issue at hand",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Templates need to be discussed and created. KPI-Standards and KPI tree. Easy connection to underlying data to get fast insights into the foundational data. Data and KPI-Lake. PowerBI, Tableau, etc. Service Now. Global solution. No need of sites to invest in all dashboard creation. Standard dashboard no own development",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "See KPI deviations faster. REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": "High Recurrency Rate of Defects, Deviations, ... because the drivers of performance are not fully understood/root-causes not known. See KPI deviations faster",
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-16",
    "name": "Root Cause Analysis & Recommender System",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-04",
    "priority": null,
    "raw_content": null,
    "summary": "System supported analysis of main drivers for deviations. Tool to perform root cause analysis in case of deviations. Agentic resolution of deviations from KPI targets (or even before it deviates). Historical Knowledge Database: Find possible root-causes in historical data for KPI's. Define improvement activities from digital applications. Actions and their status are tracked and linked to related KPI / goal. Preventive action proposal tool with early-warning mechanism before gaps arise. SME/Expert community pool to drive standardized actions across units. Tool to propose options to close gap to target (based on historical data)",
    "inspiration": null,
    "wave": "Wave 4",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "No system to automatically support high quality root cause analysis. Knowledge about possible problem resolution is fragmented across people and systems -> not accessible. Real root cause for performance issue not identified. Tool to early identify risks and opportunities",
    "TARGET / SOLUTION DESCRIPTION": "System supported analysis of main drivers for deviations. Tool to perform root cause analysis in case of deviations. Agentic resolution of deviations from KPI targets (or even before it deviates). Historical Knowledge Database: Find possible root-causes in historical data for KPI's. Define improvement activities from digital applications. Actions and their status are tracked and linked to related KPI / goal. Preventive action proposal tool with early-warning mechanism before gaps arise. SME/Expert community pool to drive standardized actions across units. Tool to propose options to close gap to target (based on historical data)",
    "TECHNOLOGIES": "ServiceNow could be a technology",
    "REQUIREMENTS": "If KPI data including limits are available, accessible then digital notification (only this part) has a low implementation effort of one to two weeks, may be a quick win",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": "High",
    "Original notes from ideation": "Digital notifications via smart devices and real-time countermeasures recommendations. Red KPI automatically show root-cause and proposed measures. AI-based proposals for solving similar known problems. Tool to early identify risks and opportunities. No system to automatically support high quality root cause analysis. Knowledge about possible problem resolution is fragmented across people and systems -> not accessible. Real root cause for performance issue not identified. Linked to action / mitigation tracker (owner, due date, commitment). Preventive action proposal tool with early-warning mechanism before gaps arise. SME/Expert community pool to drive standardized actions across units. Tool to propose options to close gap to target (based on historical data). Real-time countermeasures recommendations. Automated digital notifications via smart devices incl. escalation cascading. References to existing CAPAs addressing the same root cause",
    "Further ideas/ input (Stickers, pictures, files, ...)": "ServiceNow could be a technology. See #17. This is the base needed to be able to do #17",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: If KPI data including limits are available, accessible then digital notification (only this part) has a low implementation effort of one to two weeks, may be a quick win",
    "Potential description & quantification": "Initial evaluation: High. REDUCTION OF TIME FOR PRODUCT TRANSFER: See #17. REDUCTION OF TIME FOR PRODUCT LAUNCH: See #17. REDUCTION OF TOTAL COSTS OF SUPPLY: See #17. QUALITY (RFT): High",
    "Redundancies & Dependencies": "See #17. This is the base needed to be able to do #17",
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": "See #17"
  },
  {
    "bi_id": "PM-UC-17_B",
    "name": "Countermeasure impact and effectiveness tracker",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-04",
    "priority": null,
    "raw_content": null,
    "summary": "Tool to measure efficiency of measures with regard to gap closing. AI-based robustness check of actions. AI-based check of CAPA effectiveness. Continuous evaluation of countermeasures effectiveness. One target system. Countermeasures and effectiveness must be in the same system/module",
    "inspiration": null,
    "wave": "Wave 4",
    "effort": "Medium",
    "status": null,
    "BUSINESS PROBLEM SOLVED": "No standardized tool to measure effectiveness of countermeasures/actions. Action \"effectiveness check\" incl. timeline defined and linked to respective KPI/goal. Automated assessment of effectiveness in regards to time to resolution, reoccurrence, sustainable improvement of respective KPI or Business Goal",
    "TARGET / SOLUTION DESCRIPTION": "Tool to measure efficiency of measures with regard to gap closing. AI-based robustness check of actions. AI-based check of CAPA effectiveness. Continuous evaluation of countermeasures effectiveness. One target system. Countermeasures and effectiveness must be in the same system/module",
    "TECHNOLOGIES": "Service Now? Trackwise. Similar to MAG Tool in Successfactor",
    "REQUIREMENTS": "Countermeasures need to be in same tool as the effectiveness tracker",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": "Setting in time countermeasures without delays in transfer timeline",
    "REDUCTION TIME FOR PRODUCT LAUNCHES": "Setting in time countermeasures without delays in launch timeline",
    "REDUCTION OF TOTAL COSTS OF SUPPLY": "No delay in production plan => reduced risk for idle costs, no additional costs due to insufficient actions implemented",
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Tool to measure efficiency of measures with regard to gap closing. AI-based robustness check of actions. AI-based check of CAPA effectiveness. Continuous evaluation of countermeasures effectiveness. No standardized tool to measure effectiveness of countermeasures/actions. Action \"effectiveness check\" incl. timeline defined and linked to respective KPI/goal. Automated assessment of effectiveness in regards to time to resolution, reoccurrence, sustainable improvement of respective KPI or Business Goal",
    "Further ideas/ input (Stickers, pictures, files, ...)": "One target system (see picture). Countermeasures and effectiveness must be in the same system/module. Service Now? Trackwise. Similar to MAG Tool in Successfactor. Efficient performance steering process. Robustness increase. Reduction of costs (e.g. functional costs)",
    "Effort description & quantification": "Operating cost (Opex): Depends on system, licences cost may arise. Invest (Capex): No Capex, but initial IT Budget. Implementation time: null",
    "Potential description & quantification": "Initial evaluation: High. REDUCTION OF TIME FOR PRODUCT TRANSFER: Setting in time countermeasures without delays in transfer timeline. REDUCTION OF TIME FOR PRODUCT LAUNCH: Setting in time countermeasures without delays in launch timeline. REDUCTION OF TOTAL COSTS OF SUPPLY: No delay in production plan => reduced risk for idle costs, no additional costs due to insufficient actions implemented. QUALITY (RFT): null",
    "Redundancies & Dependencies": "Countermeasures need to be in same tool as the effectiveness tracker",
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-18",
    "name": "Performance Optimization Recommender/Benchmark",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-04",
    "priority": null,
    "raw_content": null,
    "summary": "Tool to plan scenarios through including financial impact for decision making. Scenario planning and impact assessment (automatic). Predictive Performance Management. Interface to manufacturing. Performance pattern analysis to identify performance drivers. We are identifying the drivers in performance by analyzing the underlying data",
    "inspiration": null,
    "wave": "NOW Team 2",
    "effort": "Medium",
    "status": null,
    "BUSINESS PROBLEM SOLVED": "We are lacking full understanding of high performance. Trial-and-error approach. No way to find the optimal configuration in a production setting",
    "TARGET / SOLUTION DESCRIPTION": "Tool to plan scenarios through including financial impact for decision making. Scenario planning and impact assessment (automatic). Predictive Performance Management. Interface to manufacturing. Performance pattern analysis to identify performance drivers. We are identifying the drivers in performance by analyzing the underlying data",
    "TECHNOLOGIES": "ServiceNow could be a technology. ALFRED (automated machine learning use case). Data/ KPI Lake connection. Process and machine Data",
    "REQUIREMENTS": "Good data foundation. Especially data resolution. More unique data -> Higher chance to find drivers. Definition of high performance (e.g. maximizing Output vs. quality). Impact evaluation on production planning (e.g. connect to MWB). Flexible parameter ranges to optimize potential machine learning use case",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Tool to plan scenarios through including financial impact for decision making. Scenario planning and impact assessment (automatic). Performance pattern analysis to identify performance drivers. Impact evaluation on production planning (e.g. connect to MWB). We are lacking full understanding of high performance. Trial-and-error approach. No way to find the optimal configuration in a production setting",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Good data foundation. Especially data resolution. More unique data -> Higher chance to find drivers. Definition of high performance (e.g. maximizing Output vs. quality). Impact evaluation on production planning (e.g. connect to MWB). Flexible parameter ranges to optimize potential machine learning use case. Data/ KPI Lake connection. Process and machine Data. ALFRED (automated machine learning use case). Increased effectiveness of corrective actions, reduction of Human Error Rate, reduction of recurrence rate",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "Initial evaluation: High. REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": "Victor Emenike L&I (ALFRED automated machine learning use case). Michael Fischer (MDM). Data Ownership Topic",
    "Related ongoing projects (incl. contact person)": "ALFRED (automated machine learning use case) - Victor Emenike L&I. MDM - Michael Fischer. Data Ownership Topic"
  },
  {
    "bi_id": "PM-UC-19",
    "name": "Action Tracker & PDCA Guidance",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-04",
    "priority": null,
    "raw_content": null,
    "summary": "Tool to track actions including alerting and reminding system. Integrated tracking system for action follow-up. Time assignment. Possibility to link actions to KPIs. System support for monitoring the PDCA-Cycle, especially check. Interactive PDCA cycle, digital with access to real-time KPIs. System supported determination of actions incl. description, priority, responsible person and due date. No separate tool, but part of system that indicates deviating KPI and actions. Tool automatically shows resolution status and timeline / overdue actions. Possibility to review time to resolution grouped by topic",
    "inspiration": null,
    "wave": "Wave 4",
    "effort": "Easy",
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Actions are not always consequently followed up and action owner does not sufficiently describe activities and result of problem solving",
    "TARGET / SOLUTION DESCRIPTION": "Tool to track actions including alerting and reminding system. Integrated tracking system for action follow-up. Time assignment. Possibility to link actions to KPIs. System support for monitoring the PDCA-Cycle, especially check. Interactive PDCA cycle, digital with access to real-time KPIs. System supported determination of actions incl. description, priority, responsible person and due date. No separate tool, but part of system that indicates deviating KPI and actions. Tool automatically shows resolution status and timeline / overdue actions. Possibility to review time to resolution grouped by topic",
    "TECHNOLOGIES": "ServiceNow could be a technology. Global task tracking tool, e.g. Service Now",
    "REQUIREMENTS": null,
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Integrated tracking system for action follow-up. Time assignment. Possibility to link actions to KPIs. Tool to track actions including alerting and reminding system. Actions are not always consequently followed up and action owner does not sufficiently describe activities and result of problem solving",
    "Further ideas/ input (Stickers, pictures, files, ...)": "System support for monitoring the PDCA-Cycle, especially check. Interactive PDCA cycle, digital with access to real-time KPIs. System supported determination of actions incl. description, priority, responsible person and due date. Tool to track actions including notification and reminding system. No separate tool, but part of system that indicates deviating KPI and actions. Tool automatically shows resolution status and timeline / overdue actions. Possibility to review time to resolution grouped by topic. ServiceNow could be a technology. Global task tracking tool, e.g. Service Now. Higher acceptance of actions due to less recurrence of actions",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "Initial evaluation: Medium. REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": "OPEX contact? Service Now SME",
    "Related ongoing projects (incl. contact person)": "Service Now SME"
  },
  {
    "bi_id": "PM-UC-20",
    "name": "One Single Source of Truth (Data lake)",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-E01",
    "priority": null,
    "raw_content": null,
    "summary": "Data Lake KPI Lake. Central data integration platform as single point of truth. Standardized systems. All Data are available in a data lake to be ordered. One data lake versus interconnection of various lakes. Single Source of truth. Connect all relevant data to one data foundation. Ad hoc data availability via a data lake instead of having to create new interfaces for each new report/dashboard. One pool allowing access to all relevant data. Systemic integration/interlinkage of data source to performance management tool. Central data platform as one source of truth. One central data lake as single source of truth containing data from all relevant systems. Clear definition of data source for each individual KPI",
    "inspiration": null,
    "wave": "Wave E01",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Performance relevant data are stored in various / multiple systems with limited access and interfaces. Difficulty in accessing required data due to its fragmentation across multiple systems. Data cannot be linked effectively due to a lack of standardization and harmonization. Need to create new interfaces for each new report/dashboard. Lack of a Centralized Data Inventory",
    "TARGET / SOLUTION DESCRIPTION": "Data Lake KPI Lake. Central data integration platform as single point of truth. Standardized systems. All Data are available in a data lake to be ordered. One data lake versus interconnection of various lakes. Single Source of truth. Connect all relevant data to one data foundation. Ad hoc data availability via a data lake instead of having to create new interfaces for each new report/dashboard. One pool allowing access to all relevant data. Systemic integration/interlinkage of data source to performance management tool. Central data platform as one source of truth. One central data lake as single source of truth containing data from all relevant systems. Clear definition of data source for each individual KPI",
    "TECHNOLOGIES": "Technology used in Program Dataland/ Business Warehouse",
    "REQUIREMENTS": "One harmonized approach in OneOps. Ensuring the accuracy, completeness, and consistency of the data. Easy accessibility of all data for users with business need, disregarding ownership",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": "Early identification of upcoming problem help to take countermeasures at an early point of time",
    "REDUCTION TIME FOR PRODUCT LAUNCHES": "Alignment of targets and issue solving will support all target achievements, i.e. ensures faster transfers, launches & seamless supply",
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Data Lake KPI Lake. Central data integration platform as single point of truth. Standardized systems. All Data are available in a data lake to be ordered. One data lake versus interconnection of various lakes. Single Source of truth. Performance relevant data are stored in various / multiple systems with limited access and interfaces. Difficulty in accessing required data due to its fragmentation across multiple systems. Data cannot be linked effectively due to a lack of standardization and harmonization. Need to create new interfaces for each new report/dashboard. Lack of a Centralized Data Inventory",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Connect all relevant data to one data foundation. Ad hoc data availability via a data lake instead of having to create new interfaces for each new report/dashboard. Possibility to create dashboards in a reasonable time. One pool allowing access to all relevant data. Systemic integration/interlinkage of data source to performance management tool. Central data platform as one source of truth. One central data lake as single source of truth containing data from all relevant systems. Clear definition of data source for each individual KPI. One harmonized approach in OneOps. Ensuring the accuracy, completeness, and consistency of the data. Easy accessibility of all data for users with business need, disregarding ownership. Technology used in Program Dataland/ Business Warehouse",
    "Effort description & quantification": "Operating cost (Opex): Project cost to establish interfaces for data lake. Invest (Capex): n.a.. Implementation time: Medium (1 year?)",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: Early identification of upcoming problem help to take countermeasures at an early point of time. REDUCTION OF TIME FOR PRODUCT LAUNCH: Alignment of targets and issue solving will support all target achievements, i.e. ensures faster transfers, launches & seamless supply. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": "Enabler / pre-requisite for effective KPI performance management dashboard",
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": "L&I Data Hub"
  },
  {
    "bi_id": "PM-UC-22",
    "name": "Information Model (Description of content and relevance of data)",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-E01",
    "priority": null,
    "raw_content": null,
    "summary": "Central (SME) hub to overlook & define performance mgmt. relevant data. Canonical Data Model to connect data from various systems in place and used. Tool which shows existing KPIs and the connect between KPIs. Leverage the harmonized information model to develop KPIs. Landscape of KPIs, KPI tree",
    "inspiration": null,
    "wave": "Wave E01",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Difficult to benchmark between sites. KPIs not harmonized (harmonization does not mean that KPIs need to be the same on all levels, but an improvement on shopfloor level should also reflect on site and network level). Different definition of KPIs. Interdependencies between KPIs not fully understood",
    "TARGET / SOLUTION DESCRIPTION": "Central (SME) hub to overlook & define performance mgmt. relevant data. Canonical Data Model to connect data from various systems in place and used. Tool which shows existing KPIs and the connect between KPIs. Leverage the harmonized information model to develop KPIs. Landscape of KPIs, KPI tree",
    "TECHNOLOGIES": "There is no fancy technology involved here. AI to analyse correlations between KPIs and ideally also cause and effect connections",
    "REQUIREMENTS": "Understanding what action or objective you measure with the KPI",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Central (SME) hub to overlook & define performance mgmt. relevant data. Canonical Data Model to connect data from various systems in place and used. Tool which shows existing KPIs and the connect between KPIs. Difficult to benchmark between sites. KPIs not harmonized (harmonization does not mean that KPIs need to be the same on all levels, but an improvement on shopfloor level should also reflect on site and network level). Different definition of KPIs. Interdependencies between KPIs not fully understood",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Leverage the harmonized information model to develop KPIs. Tool which shows existing KPIs and the connect between KPIs. Canonical Data Model to connect data from various systems in place and used. Central (SME) hub to overlook & define performance mgmt. relevant data. Landscape of KPIs, KPI tree. There is no fancy technology involved here. Understanding what action or objective you measure with the KPI. AI to analyse correlations between KPIs and ideally also cause and effect connections",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-23",
    "name": "Easy implementation of basic & advanced Analytical Tools",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-E01",
    "priority": null,
    "raw_content": null,
    "summary": "Basic and advanced analytics tools to effectively analyze performance data. Simple, transparent and effective tracking of mitigation actions across functions with clear responsibilities to close gaps to target. Data analysis tool",
    "inspiration": null,
    "wave": "Wave E01",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Data analytic quality depends on personal experience and skills. Analysis is very time consuming. Complex models used for most issues while simple tools could provide equal insights / solutions",
    "TARGET / SOLUTION DESCRIPTION": "Basic and advanced analytics tools to effectively analyze performance data. Simple, transparent and effective tracking of mitigation actions across functions with clear responsibilities to close gaps to target. Data analysis tool",
    "TECHNOLOGIES": "Data lake. IQ solution",
    "REQUIREMENTS": "Access to data engineers. Data analytics as a service (e.g., Service Hub)",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Basic and advanced analytics tools to effectively analyze performance data. Simple, transparent and effective tracking of mitigation actions across functions with clear responsibilities to close gaps to target. Data analytic quality depends on personal experience and skills. Analysis is very time consuming. Complex models used for most issues while simple tools could provide equal insights / solutions",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Data analysis tool. Access to data engineers. Data analytics as a service (e.g., Service Hub). Data lake. IQ solution",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-24",
    "name": "APOLLO Interface access for all digital solutions",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-E01",
    "priority": null,
    "raw_content": null,
    "summary": "Native APOLLO interface to ANY digital solution. APOLLO Interface access for all digital solutions. Future connection to AI models is needed to be ready for future use-cases. Maximizing performance by giving the means to do deeper analysis",
    "inspiration": null,
    "wave": "Wave E01",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Many of our current applications have no native connection to AI. Working manually with large amounts of data or finding patterns in data not feasible. Non-data-driven approach creates local maxima in performance instead of global",
    "TARGET / SOLUTION DESCRIPTION": "Native APOLLO interface to ANY digital solution. APOLLO Interface access for all digital solutions. Future connection to AI models is needed to be ready for future use-cases. Maximizing performance by giving the means to do deeper analysis",
    "TECHNOLOGIES": "APOLLO. Various LLM's",
    "REQUIREMENTS": "Easy and scalable way to get APOLLO integration in individual use cases. Continuously high improvement rate of AI models. Data interfaces/ KPI/ data lake. For maximum benefit: model at least partially trained on BI data",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Native APOLLO interface to ANY digital solution. Many of our current applications have no native connection to AI. Working manually with large amounts of data or finding patterns in data not feasible. Non-data-driven approach creates local maxima in performance instead of global",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Future connection to AI models is needed to be ready for future use-cases. Maximizing performance by giving the means to do deeper analysis. Easy and scalable way to get APOLLO integration in individual use cases. Continuously high improvement rate of AI models. Data interfaces/ KPI/ data lake. For maximum benefit: model at least partially trained on BI data. APOLLO. Various LLM's",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-26",
    "name": "Data mindset & according Governance",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-E02",
    "priority": null,
    "raw_content": null,
    "summary": "Ensure culture that sees data as value and everyone contributes to generating the data that arise in real time and with good quality in the system where manually necessary. Data is seen as asset and its availability as a strategic target / asset. We fix / bring data to systems instead of creating facts / alternative data outside the systems. Important for the success of the complete SEOS project. Purpose driven",
    "inspiration": null,
    "wave": "Wave E02",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "We fix / bring data to systems instead of creating facts / alternative data outside the systems. Data is not seen as asset and its availability as a strategic target / asset",
    "TARGET / SOLUTION DESCRIPTION": "Ensure culture that sees data as value and everyone contributes to generating the data that arise in real time and with good quality in the system where manually necessary. Data is seen as asset and its availability as a strategic target / asset. We fix / bring data to systems instead of creating facts / alternative data outside the systems. Important for the success of the complete SEOS project. Purpose driven",
    "TECHNOLOGIES": "Primarily no digital solution but mindset change",
    "REQUIREMENTS": "Buy-in upper management for change & transformation. Management and communication",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "We fix / bring data to systems instead of creating facts / alternative data outside the systems. Data is seen as asset and its availability as a strategic target / asset. Ensure culture that sees data as value and everyone contributes to generating the data that arise in real time and with good quality in the system where manually necessary",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Wirkung entfaltet sich mit positiver Erfahrung (Impact unfolds with positive experience). We fix / bring data to systems instead of creating facts / alternative data outside the systems. Data is seen as asset and its availability as a strategic target / asset. Important for the success of the complete SEOS project. Purpose driven. Buy-in upper management for change & transformation. Management and communication. Primarily no digital solution but mindset change",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-27",
    "name": "Health check for performance mindset/behaviour",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-E02",
    "priority": null,
    "raw_content": null,
    "summary": "(Health-checks) AI tool to support checking the maturity level regarding performance mindset of an organisation. Tool to measure engagement (number of participants in performance dialogue, number of Gemba walks, number of actions taken.....). Personal level: support to make individual behaviour transparent and show aggregated trends. Visualized Leading by example: Behavioral KPIs for leaders => adherence to company values in decision-making. Role Modeling tracker",
    "inspiration": null,
    "wave": "Wave E02",
    "effort": null,
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Lack of ambitious Performance mindset. No consequent management health-check",
    "TARGET / SOLUTION DESCRIPTION": "(Health-checks) AI tool to support checking the maturity level regarding performance mindset of an organisation. Tool to measure engagement (number of participants in performance dialogue, number of Gemba walks, number of actions taken.....). Personal level: support to make individual behaviour transparent and show aggregated trends. Visualized Leading by example: Behavioral KPIs for leaders => adherence to company values in decision-making. Role Modeling tracker",
    "TECHNOLOGIES": "Virtual campus, BI University. Performance Maturity Dashboard",
    "REQUIREMENTS": "Approval/alignment by workcouncil depending on what is measured",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "(Health-checks) AI tool to support checking the maturity level regarding performance mindset of an organisation. Tool to measure engagement (number of participants in performance dialogue, number of Gemba walks, number of actions taken.....). Personal level: support to make individual behaviour transparent and show aggregated trends. Lack of ambitious Performance mindset. No consequent management health-check",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Tool to support checking the maturity level regarding performance mindset of an organisation. Visualized Leading by example: Behavioral KPIs for leaders => adherence to company values in decision-making. Role Modeling tracker. (Health-checks) AI tool to support checking the maturity level regarding performance mindset of an organisation. Tool to measure engagement (number of participants in performance dialogue, number of Gemba walks, number of actions taken.....). Role Modeling tracker. Approval/alignment by workcouncil depending on what is measured. Virtual campus, BI University. Performance Maturity Dashboard",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  },
  {
    "bi_id": "PM-UC-32",
    "name": "Upskilling & Training for Performance with AI bot trainer",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-E03",
    "priority": null,
    "raw_content": null,
    "summary": "Offer hard skill trainings for tech / innovation topics. Using BI University to support education regarding use of digitalized tools and dashboards. Fancy trainings to educate employees (customized according to their role) in performance management. Virtual learning environments. Individualized trainings with an AI bot educating colleagues on the training gaps. Individual AI empowered agent development to boost performance. Training with AI bot / coach on individual and role based needs. KPI Interactive training. Focused development plans",
    "inspiration": null,
    "wave": "Wave E03",
    "effort": "Medium",
    "status": null,
    "BUSINESS PROBLEM SOLVED": "High human errors rate. Slow reaction to problems. Scattered responsibility. Boring training methods. Low / delayed LOS training. Confirm training completeness while not truly trained",
    "TARGET / SOLUTION DESCRIPTION": "Offer hard skill trainings for tech / innovation topics. Using BI University to support education regarding use of digitalized tools and dashboards. Fancy trainings to educate employees (customized according to their role) in performance management. Virtual learning environments. Individualized trainings with an AI bot educating colleagues on the training gaps. Individual AI empowered agent development to boost performance. Training with AI bot / coach on individual and role based needs. KPI Interactive training. Focused development plans",
    "TECHNOLOGIES": "BI University Training 2.0. LLM/Apollo. Self trained model",
    "REQUIREMENTS": "Alignment on training requirements. Sufficient training materials. Infrastructure to support knowledge management. Approval for common trainings",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": "RFT improvement, Faster decision making and task completion",
    "Original notes from ideation": "Offer hard skill trainings for tech / innovation topics. Using BI University to support education regarding use of digitalized tools and dashboards. Fancy trainings to educate employees (customized according to their role) in performance management. Interactive training. High human errors rate. Slow reaction to problems. Scattered responsibility. Boring training methods. Low / delayed LOS training",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Virtual learning environments. Individualized trainings with an AI bot educating colleagues on the training gaps. Individual AI empowered agent development to boost performance. Training with AI bot / coach on individual and role based needs. KPI Interactive training. Focused development plans. Alignment on training requirements. Sufficient training materials. Infrastructure to support knowledge management. Approval for common trainings. LOS. BI University Training 2.0. LLM/Apollo. Self trained model. RFT improvement. Faster decision making and task completion",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "Initial evaluation: High. REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): RFT improvement, Faster decision making and task completion",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": "Sue Townsend",
    "Related ongoing projects (incl. contact person)": "Sue Townsend"
  },
  {
    "bi_id": "PM-UC-33",
    "name": "Automated data & information lessons learned database",
    "area_name": "Performance Management",
    "process_step_bi_id": "PM-E03",
    "priority": null,
    "raw_content": null,
    "summary": "Automated data & information lessons learned database. Training pool is constructed that helps others to better decide, learn, not do the same errors. Instead of finding, potential solutions are suggested. Common technical language (Translating). While opening a defects there is a suggestion how to fix it based on historic data",
    "inspiration": null,
    "wave": "Wave E03",
    "effort": "Easy",
    "status": null,
    "BUSINESS PROBLEM SOLVED": "Knowledge transfer currently very manual, contained in small teams. Many people do the same in different departments and they cannot learn from each other. Knowledge transfer is dependent on persons and it's trapped in different systems without the possibility to be connected",
    "TARGET / SOLUTION DESCRIPTION": "Automated data & information lessons learned database. Training pool is constructed that helps others to better decide, learn, not do the same errors. Instead of finding, potential solutions are suggested. Common technical language (Translating). While opening a defects there is a suggestion how to fix it based on historic data",
    "TECHNOLOGIES": "DocuBot. Service Now and OPEX prime. IQNow. Sharepoint",
    "REQUIREMENTS": "Connected system, data collected (not only words, but also machine and process data). Connection OPEX prime offers a solution (not yet fully developed)",
    "RELEVANTS": null,
    "REDUCTION TIME FOR PRODUCT TRANSFER": null,
    "REDUCTION TIME FOR PRODUCT LAUNCHES": null,
    "REDUCTION OF TOTAL COSTS OF SUPPLY": null,
    "QUALITY IMPROVEMENT": null,
    "Original notes from ideation": "Automated data & information lessons learned database. Knowledge transfer currently very manual, contained in small teams. Many people do the same in different departments and they cannot learn from each other. Knowledge transfer is dependent on persons and it's trapped in different systems without the possibility to be connected",
    "Further ideas/ input (Stickers, pictures, files, ...)": "Training pool is constructed that helps others to better decide, learn, not do the same errors. Instead of finding, potential solutions are suggested. Common technical language (Translating). While opening a defects there is a suggestion how to fix it based on historic data. Connected system, data collected (not only words, but also machine and process data). DocuBot. Service Now and OPEX prime. IQNow. Sharepoint. Connection OPEX prime offers a solution (not yet fully developed)",
    "Effort description & quantification": "Operating cost (Opex): null. Invest (Capex): null. Implementation time: null",
    "Potential description & quantification": "Initial evaluation: Medium. REDUCTION OF TIME FOR PRODUCT TRANSFER: null. REDUCTION OF TIME FOR PRODUCT LAUNCH: null. REDUCTION OF TOTAL COSTS OF SUPPLY: null. QUALITY (RFT): null",
    "Redundancies & Dependencies": null,
    "Contact persons for further detailing": null,
    "Related ongoing projects (incl. contact person)": null
  }
]