[
  {
    "bi_id": "PM-01",
    "name": "01 | Breaking down goals and setting targets",
    "area_name": "Performance Management",
    "step_description": "Based on given strategic company goals, relevant and binding unit-specific targets are broken down and set.",
    "raw_content": null,
    "summary": null,
    "vision_statement": "Strategic goals are translated and broken down into team targets through standardized principles and system-driven insights. This enables clear alignment, measurable impact, and scalable performance management.",
    "in_scope": null,
    "out_of_scope": null,
    "interfaces_text": null,
    "what_is_actually_done": null,
    "pain_points": "Commitment of all involved parties\nNo standarized approach in breaking down goals\nMore focus (not too many of the highest priority)\nCo-dependencies of goals",
    "targets_text": "Commitment and Engagement of All Stakeholders\nPrioritization is based on clearly defined criteria\nprocess is scalable and applicable across the organization\nTransparent mapping of goal linkages and dependencies"
  },
  {
    "bi_id": "PM-02",
    "name": "02 | KPI Definition & Cascading",
    "area_name": "Performance Management",
    "step_description": "KPIs are defined based on realistic baselines and strategic relevance. A harmonized framework ensures transparency, avoids overload, and supports all critical goals with measurable indicators.",
    "raw_content": null,
    "summary": null,
    "vision_statement": "Standardized KPIs are accessible and understandable at every level, enabling proactive steering and strategic alignment.",
    "in_scope": null,
    "out_of_scope": null,
    "interfaces_text": null,
    "what_is_actually_done": null,
    "pain_points": "Non-achievable targets\nRisk of too many KPIs\nWhich KPIs do we have for launch readiness?\nStandardization over different departments leads to unachievable targets\nimportant goals lack KPIs\nNo transparency on the KPI/Goal cascade\nConflicting objectives/KPIS, manage competing KPIs\nNo synergies and low cross usadge of existing tools or KPIs",
    "targets_text": "KPIs are defined based on data-driven baselines and realistic assumptions.\nA harmonized KPI framework allows for comparability without enforcing one-size-fits-all targets.\nClear criteria guide the selection and prioritization of KPIs (e.g., strategic relevance, measurability).\nAll critical goals, including launch readiness and strategic initiatives, are backed by measurable KPIs\nConflicting KPIs and objectives are identified and resolved early in the process.\nThe KPI cascade is clearly documented and accessible across all levels\nExisting KPIs and tools are reused and shared across departments where possible"
  },
  {
    "bi_id": "PM-03",
    "name": "03 | Monitoring & Performance Dialogues",
    "area_name": "Performance Management",
    "step_description": "Performance is monitored via real-time, standardized dashboards. Automated alerts and structured dialogues enable fast, data-driven gap closure across all units.",
    "raw_content": null,
    "summary": null,
    "vision_statement": "Automated, standardized monitoring ensures comparable, actionable insights and fosters continuous performance discussions throughout the organization.",
    "in_scope": null,
    "out_of_scope": null,
    "interfaces_text": null,
    "what_is_actually_done": null,
    "pain_points": "No process for closing the GAP - focus is not sufficient - process too slow\nno data driven approach\nKPI definitions are challenged too often\nPerformance Dialogues not existing everywhere\nData resolution is different in different BU's\nAggregated data doesn't allow adequated analysis and action definition\nManual KPI deviation detection with trend monitoring and simulation\nDifficult and long proccess to get SAP data\nNo notifications via smart devices and real-time counter measures recommendations\nNo standardized dashboard tool is available --> everyone is using a different tool\nstatic PDMs, few or no digital access to real-time KPIs",
    "targets_text": "KPI definitions are standardized and accepted across all business units\nPerformance dialogues are based on reliable, real-time data\nKPI deviations are detected automatically using trend analysis and simulations.\nPerformance dialogues are institutionalized across all units and levels.\nStructured and Fast Gap-Closing Process\nData granularity is aligned across business units to enable meaningful comparisons and analysis\nA unified dashboard tool is used across the organization\nManual data retrieval is eliminated through automation"
  },
  {
    "bi_id": "PM-04",
    "name": "04 | Gap Closure & Continuous Improvement",
    "area_name": "Performance Management",
    "step_description": "Risks and opportunities are identified early using predictive KPIs and pattern analysis. Scenario simulations and standardized actions enable fast, data-driven gap closure and continuous improvement.",
    "raw_content": null,
    "summary": null,
    "vision_statement": "Risks and opportunities are identified through automated, data-driven analysis, enabling proactive action and continuous improvement measures including linkage to financial impact.",
    "in_scope": null,
    "out_of_scope": null,
    "interfaces_text": null,
    "what_is_actually_done": null,
    "pain_points": "No automate proposals for solving similar known problems\nNo Performance pattern analysis to identify performance drivers\nno integrated scenario development to close gaps\nlack of understanding of dependencies between KPIs => single green KPI might not be according to benchmark\nno appropriate actions taken and no standardized tracking tool for actions\nlack of forward looking KPIs prevents early gap closure measures\nKPIs are currently not sufficiently used to identify opportunities or continuous improvmenet\nNo sufficient measurement of efficiency of measures",
    "targets_text": "The system leverages historical data to suggest proven countermeasures for recurring problems\nPatterns are used proactively to detect risks and opportunities early\nKPIs are actively used to uncover improvement potential and innovation opportunities\nScenario simulations are embedded in the performance process to evaluate potential actions\nPredictive indicators are used to anticipate performance gaps and trigger early interventions\nAccountability and follow-up are embedded in the process\nThe impact of improvement measures is systematically evaluated\nKPI relationships are visualized and understood to avoid misleading interpretations"
  },
  {
    "bi_id": "PM-E01",
    "name": "E01 | Data Collection & Analysis",
    "area_name": "Performance Management",
    "step_description": "A unified, real-time data foundation enables automated, AI-supported analysis. Harmonized systems and structures ensure consistent, scalable insights across the organization.",
    "raw_content": null,
    "summary": null,
    "vision_statement": "Data from all relevant sources is seamlessly connected through standardized systems and available in real time, enabling smooth flexible analysis and decision-making across all levels.",
    "in_scope": null,
    "out_of_scope": null,
    "interfaces_text": null,
    "what_is_actually_done": null,
    "pain_points": "No single source of truth\nNo harmonized data foundation & information model\nvarious systems for the same purpose (PowerBI, Tableau, SAC, ....)\nNo real time, no forward looking automated KPI calculation\nstill many manual entries needed\nNo advanced/ AI supported analysis tools\nno automated aggregation\nNot inter linked data\nNot harmonized data in different sources\nNo alerting system (AI supported recognition of tendencies, abnormalities etc.)\nOften no sustainable data provision (Excel, paper sheets) -> not necessarily easy to integrate, manual effort required\ndata resolution and thereby interpretation is different\ndigital system incentivises positive behaviour instead of punishing the wrong one",
    "targets_text": "A centralized, trusted data platform ensures consistency and reliability across all performance data\nHarmonized Data Foundation and Information Model enables seamless integration and interpretation across systems and departments\nKPIs are calculated automatically in real time, with forward-looking capabilities (e.g., forecasting, trend analysis).\nRedundant tools (e.g., Power BI, Tableau, SAC) are streamlined or integrated into a cohesive analytics environment.\nData entry and aggregation are automated wherever possible\nData from different sources is interconnected\nsmart alerting systems notify users of deviations, risks, or opportunities in real time\nData is provided through robust, scalable systems\nData granularity is harmonized to support consistent interpretation across departments"
  },
  {
    "bi_id": "PM-E02",
    "name": "E02 | Cultural Change Management",
    "area_name": "Performance Management",
    "step_description": "A data-driven, performance-oriented mindset is fostered across all levels. Change readiness and business acumen are strengthened to support new ways of working.",
    "raw_content": null,
    "summary": null,
    "vision_statement": "Systems support transparency of behaviors and foster ownership and accountability for data, enabling a strong performance mindset.",
    "in_scope": null,
    "out_of_scope": null,
    "interfaces_text": null,
    "what_is_actually_done": null,
    "pain_points": "People are sticking to familiar systems/processes\nLack of data savy of our employees\nLack of business acumen\nLack of ambitious Performance mindset\nNo consequent management",
    "targets_text": "Openness to Change and New Ways of Working\n--> opportunity for growth\nData-driven thinking becomes a core competency at all levels\nEmployees understand the broader business context and how their work contributes to strategic goals\nAmbitious and Ownership-Driven Performance Mindset\n-->\nIndividuals take ownership of their performance\nManagement consistently reinforces desired behaviors and addresses underperformance"
  },
  {
    "bi_id": "PM-E03",
    "name": "E03 | Employee qualification & development",
    "area_name": "Performance Management",
    "step_description": "Training is tailored to individual needs using system-generated suggestions. Hands-on formats and playbooks support digital skills and performance management.",
    "raw_content": null,
    "summary": null,
    "vision_statement": "Digitalization empowers employee development by making learning more personalized, accessible, data-driven, and scalable across the organization.",
    "in_scope": null,
    "out_of_scope": null,
    "interfaces_text": null,
    "what_is_actually_done": null,
    "pain_points": "System generated training proposals based on excisting knoledge\nTrainings are the same for each employee and independant of knowledge base\nMissing data mindset\nNo monthly updated MAG target achievement overview\nNo training suggestions generated by the system\nNo hands-On training and handbooks for new digital applications/solutions\nNo playbook for performance management including training for all staff",
    "targets_text": "Personalized, Knowledge-Based Training Recommendations\nTrainings are no longer “one-size-fits-all” but reflect individual skill levels and development goals\nEmployees understand how to use data for decision-making and performance improvement\nTransparent and Regular Performance Development Tracking\nPractical, scenario-based training and user-friendly handbooks are available for all new digital applications\nRole based learning:\nThe system proactively recommends relevant training based on role, performance gaps, and future needs\nA clear, accessible playbook outlines the performance management process and expectations"
  }
]