[
  {
    "bi_id": "PS-QA-001",
    "name": "Quality assurance enabling processes",
    "area_name": "Quality Assurance",
    "step_description": "This area focuses on achieving efficient quality assurance through smart documentation management, employee-centric learning journeys, and meaningful integration of external partners. It covers the lifecycle of controlled documents (like SOPs), training, data integrity, and interactions with external entities.",
    "what_is_actually_done": "Manages Standard Operating Procedures (SOPs): AI-assisted creation, updates to new templates, adherence to good writing practices, and automated translations within e-DMS (VQD). (QA01) Provides Information: Employs AI (LLM) for need-driven retrieval of documents and content summaries from e-DMS (VQD). (QA02/QA03-text) External Partner Integration: Manages seamless and secure data transfer (production data, analytical results, discrepancies, changes, CAPAs) with external partners (CMOs/sponsors) via direct integration or platforms like SNCP. (QA03/QA06-text) External GMP Document Handling: Automates archiving of external GMP documents into eDMS. (QA04/QA08-text) Learning Management: Implements role-based learning, automated curricula assignment, multimedia modules, and integrates learning achievements with system access. (QA05/QA04-text) MBR Review Support: Uses AI to support Master Batch Record (MBR) review for adherence to dossier documents. (QA06/QA07-text) Guided Workflows: Provides system/bot guidance for employees executing tasks according to SOPs. (QA07/QA02-text) Quality Reporting: Automates KPI calculation and quality reporting by integrating data from various sources into dashboards. (QA08/QA05-text) Oversees Documentation Management Systems. Manages Learning Management processes. Ensures Data Integrity principles are applied. Manages interactions and documentation related to External Management (partners, suppliers).",
    "interfaces_text": "Manufacturing (PS-M-XXX): SOP execution, MBR content, training for manufacturing personnel.\nQuality Control (PS-QC-XXX): SOPs for QC processes, training for QC personnel, data from external labs.\nSupply Chain Management (PS-SCM-XXX): Processes involving external partners, data exchange.\nRegulatory Affairs: Dossier documents for MBR alignment, SOPs impacting submissions.\nIT: e-DMS (VQD), AI platforms (iQ Now), learning management systems (LOS), integration platforms (SNCP).\nExternal Partners (CMOs, Sponsors): Data exchange, document sharing, learning requirements.\nPS-QA-002 (Product related QA enabling processes): SOP updates may trigger change controls.\nPS-QA-004 (Non-conformance and event management): SOPs define deviation handling; external partner issues.",
    "pain_points": "Manual, tedious, and complex SOP creation, update, and review processes; difficult comment management in VQD. (QA01, P26)\nManual effort for SOP translations and formatting. (QA01)\nCumbersome document/content retrieval; search not intuitive. (QA03-text)\nInefficient and data integrity-prone manual data transfer with external partners (copy-paste). (QA06-text, P26)\nRedundant manual steps in archiving external GMP documents. (QA08-text)\nLearning primarily based on \"reading\"; unclear data integrity definitions; time-consuming LOS recordings. (P26, QA04-text)\nManual MBR alignment with dossiers. (QA07-text)\nTedious, manual, and site-specific compilation for Quality Management Reviews (QMR). (QA05-text, P26)\nLack of system/interface simplicity and connectivity; disparate IT solutions. (P26)\nInsufficient budget for digitalization projects. (P26)\nData quality, connectivity, and accessibility issues for reporting and KPIs. (P26)"
  },
  {
    "bi_id": "PS-QA-002",
    "name": "Product related QA enabling processes",
    "area_name": "Quality Assurance",
    "step_description": "This area focuses on proactively managing company risks and changes related to products, leveraging technology to enable guided actions and ensure high quality. It includes change control, APQR, and risk management for products.",
    "what_is_actually_done": "Change Control Management: Manages changes via a harmonized, user-friendly system, potentially using AI for impact assessment, identifying recurrent events, and risk highlighting. (QA09) APQR Generation: Automates or semi-automates Annual Product Quality Review generation, including trend analysis and identifying improvement opportunities. (QA10) Risk Management: Implements proactive and automated risk management tools, including AI-supported risk communication and an automated risk register from various sources. (QA11/QA12-text) Multi-site Data Analysis: Compares multi-site data (e.g., from APQRs) for proactive trend detection to differentiate site vs. product issues, potentially AI-supported. (QA12/QA11-text) Manages Quality Risk Management processes for products. Addresses QA aspects of Medical Devices & Combination Products. Oversees the Change Management process. Manages the Annual Product Quality Review process.",
    "interfaces_text": "Manufacturing (PS-M-XXX): Product/process changes, data for APQRs and risk assessments.\nQuality Control (PS-QC-XXX): Data for APQRs, analytical changes, risk assessments.\nRegulatory Affairs: Changes impacting regulatory submissions, risk information.\nSupply Chain Management (PS-SCM-XXX): Product-related risks, changes affecting supply.\nPS-QA-001 (QA enabling processes): SOP updates leading to changes.\nPS-QA-004 (Non-conformance and event management): Deviations triggering changes or risk reviews.\nPS-QA-005 (Production and process control): Data input for APQR, risk management.\nExternal Partners (CMOs): Data for APQRs (CMO PQR internalization), changes at CMOs.",
    "pain_points": "Change Control (CC) process in GoTrack is not user-friendly and too complex. (QA09, P26)\nSignificant manual data screening required for APQRs; APQRs not generated automatically or easily. (QA10, P26)\nHigh effort for internalizing CMO Product Quality Reviews (PQRs). (P26)\nLack of a centralized company risk register; quality risks captured in disparate IT systems. (QA12-text, P26)\nManual impact assessment and identification of changes. (P26)\nInsufficient know-how and willingness for data-driven decision-making. (P26)\nChange control process involves high manual user interaction and often overly complex risk assessments. (P26)\nDevice lifecycle management is a manual, paper-based process. (P26)\nChallenges with using supplier/external partner data and interfaces for product quality. (P26)"
  },
  {
    "bi_id": "PS-QA-003",
    "name": "Audit and intelligence",
    "area_name": "Quality Assurance",
    "step_description": "This area aims to achieve maximum quality oversight with minimum effort through seamlessly integrated, AI-supported audit and intelligence processes. It covers quality audits, regulatory intelligence, and pharmacopoeial intelligence.",
    "what_is_actually_done": "Regulatory & Pharmacopoeial Intelligence (RIN/PIN): Manages RIN/PIN using AI for automated checks of external requirements against internal standards, proposing adaptations, generating change requests, and supporting impact assessments. (QA13) Audit & Inspection Learnings: Leverages learnings from audits/inspections, using AI to summarize reports, ensure regulatory basis for observations, and communicate findings effectively. (QA14) Observation Follow-up Automation: Automates the follow-up of audit observations, including assigning CAPAs to external parties and tracking completion. (QA15) Conducts Quality Audits (internal, external/supplier). Manages Regulatory Intelligence processes. Manages Pharmacopoeial Intelligence processes.",
    "interfaces_text": "Manufacturing Sites (PS-M-XXX): Subject to audits, implement changes from RIN/PIN.\nQuality Control Labs (PS-QC-XXX): Subject to audits.\nExternal Partners/Suppliers: Subject to audits, follow-up on observations.\nRegulatory Authorities: Inspections, source of regulatory intelligence.\nPS-QA-001 (QA enabling processes): Internal standards (SOPs) checked against external requirements, external partner management.\nPS-QA-002 (Product related QA enabling processes): RIN/PIN updates may trigger change controls.\nPS-QA-004 (Non-conformance and event management): Audit findings often result in CAPAs.\nIT: AI tools, intelligence platforms (PowerApp for PIN), GoTrack audit module.",
    "pain_points": "Manual, time-consuming, and risk-prone RIN/PIN processes, especially for supporting CMOs with RI. (QA13, P26)\nPIN/RIN data handled in non-validated systems (PowerApp for PIN) lacking IT support and struggling with data volume. (P26)\nDifficult to connect audit data to sites; lack of structured fields. (P26)\nAudit observations not consistently attributed to correct categories. (P26)\nMedDev/CP requirements not widely known by auditors/auditees. (P26)\nLow quality of Master Data Management (MDM) for vendors/suppliers in GoTrack audit module. (P26)\nDelays and confidentiality issues in documenting passive audit information. (P26)\nSignificant time demanded from local sites for audit preparations due to lack of continuous audit readiness. (P26)\nInconsistent/inefficient QMS categories for audit findings. (P26)\nLack of an easily accessible overview of audit results. (P26)\nAuditor qualification is a manual and error-prone process. (P26)\nMandatory impact assessment for sites potentially affected by audit/RIN/PIN findings. (P26)"
  },
  {
    "bi_id": "PS-QA-004",
    "name": "Non-conformance and event management",
    "area_name": "Quality Assurance",
    "step_description": "This area aims for a future where non-conformance and event management is automated, with interconnected processes, intelligent systems, and seamless investigation guidance. It includes managing discrepancies, OOS, complaints, quality issues, market actions, investigations, and CAPAs.",
    "what_is_actually_done": "eQMS Record Creation Assistance: Uses AI to provide in-system proposals for creating adequate content or verifying existing content in eQMS records. (QA16/QA19-text) Non-conformance & Event Management Tool: Provides a fit-for-purpose tool for managing non-conformances and events, including specific considerations for CMO management. (QA17/QA16-text) Deviation & CAPA List Generation: Enables modular generation of deviation and CAPA lists for easier retrieval and reporting. (QA18/QA17-text) ERP & eQMS Integration: Fully integrates ERP (e.g., SAP) and eQMS systems for automated actions like batch blocking and data retrieval. (QA19/QA20-text) Discrepancy Investigation Simplification: Simplifies investigations using AI for methodological support, documentation (e.g., executive summaries), and ensuring logical writing. (QA20/QA18-text) Integrated QMS Foundation: Establishes a new, integrated eQMS foundation for improved process connectivity and traceability of records. (QA21) Manages Discrepancy Management processes. Manages OOS-Management (Out of Specification). Handles Technical Product Complaints. Manages Quality Issues & Market Actions. Oversees Investigation Management. Manages CAPA (Corrective and Preventive Action) Management.",
    "interfaces_text": "Manufacturing (PS-M-XXX): Source of deviations, events, batch information for blocking/release.\nQuality Control (PS-QC-XXX): OOS results, lab investigations.\nSupply Chain Management (PS-SCM-XXX): Market actions, recall support, complaints handling.\nRegulatory Affairs: Reporting critical deviations, market actions.\nPS-QA-001 (QA enabling processes): SOPs define handling of non-conformances.\nPS-QA-002 (Product related QA enabling processes): CAPAs may lead to change controls.\nPS-QA-003 (Audit and intelligence): Audit findings often lead to non-conformances/CAPAs.\nPS-QA-005 (Production and process control): Production deviations, EM excursions.\nPS-QA-008 (Product release, packaging & labelling): Release decisions impacted by open deviations.\nIT: eQMS (GoTrack), ERP (SAP), AI tools.",
    "pain_points": "Current eQMS records are partially inconsistent and incomplete. (QA19-text)\nGoTrack for CMO Management may not always be fit-for-purpose (mandatory fields, process steps). (QA16-text)\nDifficult retrieval of deviation/CAPA lists. (QA17-text)\nLack of full, seamless integration between ERP and eQMS (GoTrack); manual data transfer for batch blocking, etc. (QA20-text, P27)\nInvestigations are high-effort; documentation is complex; need for AI to support good writing and methodology. (QA18-text, P27)\neQMS modules are siloed, lacking interconnectivity and traceability (e.g., between CAPAs and source). (QA21, P27)\nRecord creation and processing not possible for external partners. (P27)\nDeviation 2.0 GoTrack module not fully matching 3PQM needs. (P27)\nUnclear restrictions in GoTrack regarding user permissions. (P27)\nCross-checking during investigations is a manual task. (P27)\nNo direct data support from systems available to investigators during investigations. (P27)\nQuality Issues & Market Action processes are not integrated with other core processes (Dev, TPC, OOX). (P27)\nHigh manual effort in creating and processing Technical Product Complaints; Complaint Mgt lacks full MDG linkage. (P27)"
  },
  {
    "bi_id": "PS-QA-005",
    "name": "Production and process control",
    "area_name": "Quality Assurance",
    "step_description": "This area aims for fully digitalized and integrated Production Control Strategy (CSS) and Contamination Control Strategy (CCS) systems, allowing for automated assessments and reducing error-prone manual efforts in maintaining control over manufacturing processes.",
    "what_is_actually_done": "CCS & CSS Lifecycle Management: Manages the lifecycle of Contamination Control Strategy (CCS) and general Control Strategies (CSS) via a digital tool, including risk management and interfaces for multi-site products/CMOs. AI assists in risk assessment. (QA22) Incident Monitoring: Provides transparent monitoring of incidents (e.g., microbiological events) connected to batch data, with automated summaries of affected batches. (QA23) Oversees Aseptic Manufacturing processes, including Contamination Control Strategy. Manages Environmental Monitoring programs, including micro-testing. Defines and maintains Control Strategies for products and processes.",
    "interfaces_text": "Manufacturing (PS-M-XXX): Execution of aseptic processes, environmental monitoring, implementation of control strategies, batch data.\nQuality Control (PS-QC-XXX): Microbiological testing, EM data analysis and trending.\nEngineering/Maintenance (PS-MAINT-XXX): Facility design, equipment qualification, maintenance related to CCS/CSS.\nPS-QA-002 (Product related QA enabling processes): Control strategies are key product knowledge and subject to change control.\nPS-QA-004 (Non-conformance and event management): EM excursions or process deviations are managed as events/non-conformances.\nPS-QA-006 (Validation and qualification): Validation of aseptic processes and cleaning is linked to CCS.\nIT: Digital tools for CSS/CCS management, EM data systems.",
    "pain_points": "Manual, paper-based, and inefficient CSS/CCS lifecycle management; complex manual integration of CMO-related CSS. (QA22)\nChallenging CSS establishment and maintenance for multi-site products. (P27)\nCSS information often resides in Excel (XLS) with manual data entries. (P27)\nContamination Control Strategy not fully digitalized (QRM GoTrack adoption in progress). (P27)\nControl strategy and associated risk management are not digitalized; knowledge pool is hardly accessible. (P27)\nLack of automated connection between CSS, Manufacturing Instructions (HU), Master Validation Plans, etc. (P27)\nManual calculation of results for control limits. (P27)\nData integrity gaps in global Environmental Monitoring (EM) software. (P27)\nCSS system is largely manual (xlsx) with no interaction with other systems like GoTrack. (P27)\nNeed for continuous assessment of CSS with CPV to reduce effort in low-risk areas. (P27)\nManual review of affected batches in case of microbiological events. (QA23)\nNeed for continuous EM monitoring to optimize QC tasks. (P27)\nLack of connectivity to master data (GBS) for EM/CSS. (P27)"
  },
  {
    "bi_id": "PS-QA-006",
    "name": "Validation and qualification",
    "area_name": "Quality Assurance",
    "step_description": "This area focuses on accelerating industrialization and enabling data-driven decisions through purposefully tailored data provision and automated qualification and validation processes across the product and system lifecycle.",
    "what_is_actually_done": "Automated Document Draft Generation: Automates the generation of System Life Cycle (SLC) document drafts (e.g., for CSV, Data Integrity Risk Assessments) and product lifecycle document drafts (qualification, validation) using AI, incorporating risk-based approaches and historical data. (QA24) Digital Document Integration: Ensures SLC and other validation/qualification documents are digitally integrated over their lifecycle for enhanced traceability. (QA25) Manages Transport Qualification/Validation. Oversees Process Validation activities. Manages Cleaning Validation. Manages Computer System Validation (CSV).",
    "interfaces_text": "Manufacturing (PS-M-XXX): Processes, equipment, and systems requiring validation/qualification.\nQuality Control (PS-QC-XXX): Analytical methods validation, lab equipment qualification.\nEngineering/Maintenance (PS-MAINT-XXX): Facility, utility, and equipment qualification.\nIT: Computer systems requiring validation (CSV), data sources for AI-assisted documentation.\nSupply Chain Management (PS-SCM-XXX): Transport validation.\nPS-QA-002 (Product related QA enabling processes): Changes to products/processes trigger re-validation.\nPS-QA-005 (Production and process control): CCS linked to cleaning validation.\nDevelopment/R&D: Input for process validation (e.g., development data for transfer plans).",
    "pain_points": "Inefficient, inconsistent, and manual creation of SLC, qualification, and validation documents. (QA24)\nLack of AI-supported writing for Validation Documents. (P27)\nLimited experience with external launches concerning validation efforts. (P27)\nNeed for automated testing for validation purposes. (P27)\nChallenging application of statistical approaches (matrixing/bracketing, sampling plans) in transfers/Process Validation. (QA24, P27)\nContinued Process Verification (CPV) is still very manual with minimal data integration. (P27)\nDifficult traceability of SLC documents throughout their lifecycle. (QA25)\nLack of automated traceability for validation documentation. (P27)\nValidation reports, including data assessment, are mainly created manually. (P27)\nBenchmarking and authority trends for validation strategies are not easily accessible. (P27)\nUnclear validation requirements (what to check against what). (P27)\nNo central overview/repository for stability data relevant to PV. (P27)\nSignificant manual execution in cleaning validation (sampling, batch marking, translating results to master recipes). (P27)\nInconsistent risk-based approaches for cleaning validation across sites for similar equipment. (P27)\nRisk assessments and testing strategies are not effectively integrated into data systems for leverage in validation. (P27)\nNeed for connectivity to master data (GBS) for Medical Devices, Data Integrity, CSV. (P27)"
  },
  {
    "bi_id": "PS-QA-007",
    "name": "Facility and equipment lifecycle",
    "area_name": "Quality Assurance",
    "step_description": "This area aims to establish real-time, end-to-end lifecycle transparency for facility and equipment status to enable streamlined asset management, including cleaning, maintenance, and calibration.",
    "what_is_actually_done": "Digital Cleaning Documentation: Manages digital cleaning documentation for rooms, potentially via an electronic logbook framework and tracking solution, providing real-time room status accessible at the location. (QA26) Global Equipment Transparency: Provides global digital transparency of manufacturing and analytical equipment status (including lab equipment) through a central database, enabling transferability of lifecycle documents and supporting initiatives like Lab4U. (QA27) Manages QA oversight of Utilities. Manages QA oversight of Facilities. Manages QA oversight of Zoning. Manages QA oversight of Maintenance & Calibration programs (interfacing with Maintenance).",
    "interfaces_text": "Maintenance (PS-MAINT-XXX): Calibration and maintenance activities, equipment status, work orders.\nManufacturing (PS-M-XXX): Equipment usage, room cleaning, facility status information.\nQuality Control (PS-QC-XXX): Lab equipment lifecycle, status, calibration.\nEngineering: Facility and equipment design, lifecycle documentation.\nIT: Databases for equipment status, electronic logbook systems.\nPS-QA-005 (Production and process control): Zoning, environmental control linked to facilities.",
    "pain_points": "Insufficient transparency of clean room status due to paper-based or non-integrated cleaning documentation. (QA26)\nLack of global digital transparency of equipment status across sites, hindering transfer planning and asset utilization. (QA27)\nLow guidance for calibration and maintenance; decisions based on individual site/equipment; lack of usable data for assessment. (P28)\nData-driven review of calibration/maintenance intervals is not performed or is a manual process. (P28)\nAutomated assessment/review of \"roombooks\" for zoning not possible; difficult to compare site definitions. (P28)\nFacility/equipment data often entered and managed in Excel files. (P28)\nLack of automated engineering guidance based on assessable best practice data. (P28)\nNo automated check of affected materials/batches in case of facility/equipment non-compliance. (P28)\nChallenges posed by aging and existing facilities. (P28)\nNeed for shared facility risk assessment, cross-site checks, and evaluation of identified risks. (P28)"
  },
  {
    "bi_id": "PS-QA-008",
    "name": "Product release, packaging & labelling",
    "area_name": "Quality Assurance",
    "step_description": "This area focuses on achieving fully digitalized processes and seamless data integration across the supply chain to enable automated, compliant batch release and full product traceability.",
    "what_is_actually_done": "Digital Batch Release Hub: Establishes a centralized digital hub for batch release, providing all relevant information at a glance, supporting automated release decisions, dossier compliance checks (vs. RIM/CPD3), and flexible generation of certificates (CoA/CoC). (QA28) Advanced Global Batch Traceability: Implements comprehensive global batch traceability, including for CMOs and potentially down to unit-level, using technologies like blockchain for security and integrity. (QA29/QA30-text) AI-supported Anti-Counterfeiting: Manages anti-counterfeiting investigations and activities using AI for detection (on/offline), intelligence gathering, case management, risk-based measure bundling, and effectiveness assessment. (QA30/QA31-text) Integrated Artwork Management: Implements an integrated tool for artwork management to reduce manual effort and ensure seamless handover of labeling data (from RA to packaging). (QA31/QA29-text) Ensures Supply Chain Integrity (coding, anti-counterfeiting). Manages Artwork Management & External Labeling processes. Provides QA oversight for Packaging & Repackaging operations. Provides QA oversight for Logistics & Distribution. Manages Batch Disposition processes.",
    "interfaces_text": "Manufacturing (PS-M-XXX): Batch records, packaging information, production data for release.\nQuality Control (PS-QC-XXX): Batch testing results for release.\nSupply Chain Management (PS-SCM-XXX): Logistics, distribution, inventory, serialization, anti-counterfeiting operations, artwork lifecycle management.\nRegulatory Affairs: Approved labeling, dossier information for release compliance, country-specific requirements.\nPS-QA-004 (Non-conformance and event management): Open deviations or investigations impacting batch release.\nExternal Partners (CMOs): Batch release information, traceability data from/to CMOs.\nLegal: Anti-counterfeiting activities, market actions.\nIT: Batch release systems, traceability platforms, artwork management tools, AI for anti-counterfeiting.",
    "pain_points": "Lack of a central system for batch release; manual compliance checks; all relevant data for release not in one system. (QA28, P28)\nIncomplete global batch traceability, especially for CMOs and down to unit-level. (QA30-text, P28)\nManual, potentially biased screening and management of anti-counterfeiting measures; Case IQ not globally rolled out. (QA31-text, P28)\nManual work and disconnects in artwork management processes between Medicine & OPS. (QA29-text)\nGS1 not established as a central standard for BI products. (P28)\nHighly complex, manual systems to ensure country-specific suitability for OCs (Pharma LIMS). (P28)\nProduct development information (IU) not easily accessible to OPS for troubleshooting. (P28)\nHigh number of potential market actions due to labeling issues. (P28)\nUpcoming system changes (GBS United) might negatively impact paperless release potential. (P28)\nManual transfer of variable data requirements to packaging lines. (P28)\nComplex batch record review for new/launch products due to multiple requirement sources. (QA28, P28)\nLack of a global Batch Release Hub. (P28)\nChallenges with label/packaging material reconciliation. (P28)\nNo end-to-end approach for label data and changes. (P28)"
  }
]