[
  {
    "bi_id": "PS-QC-001",
    "name": "LAB PLANNING AND SCHEDULING",
    "area_name": "Quality Control",
    "step_description": "This step focuses on ensuring the efficient use of laboratory resources through automated and data-driven planning and scheduling. It covers short and long-term requirements and is linked end-to-end with the supply chain and production schedule. It includes integrated lab planning, scheduling, management systems, digital performance dashboards, and standardized QC ordering systems.",
    "what_is_actually_done": "Develop a unified system for comprehensive lab scheduling, capacity planning (team/expert level), and predictive adjustments. Allocate tasks based on priority and track equipment utilization and status. Integrate with shift planning, production planning, and stability testing planning. Provide a centralized dashboard with real-time data, drag-and-drop scheduling, and conflict resolution. Manage resources (FTE, chemicals, equipment) for modular and flexible planning. Enable retrospective evaluation of plan vs. reality (QC01 / USE CASE 1). Create a digital dashboard to display real-time lab performance metrics (e.g., OEE, deviations, equipment failures). Provide alerts for performance deviations. Enable historical data analysis and trend identification for performance improvement. Facilitate communication through built-in messaging and notification systems (QC02 / USE CASE 2). Implement a global, standardized sourcing process and system for lab materials with a standard catalogue. Manage inventory with automated tracking, replenishment triggers based on minimum stock levels. Integrate with quality management systems for CoA attachment and real-time order status. Harmonize ordering processes via a central system/hub (QC03 / USE CASE 3).",
    "interfaces_text": "Production Planning/Manufacturing: For production schedules, incoming goods information, and IPC requirements. (QC01, page 6, USE CASE 1)\nSupply Chain Management (SCM): For long-term requirements and E2E linkage. (page 6)\nShift Planning / HR: For personnel availability and scheduling. (USE CASE 1)\nProcurement/Source2Pay: For ordering lab materials and supplier information. (QC03, USE CASE 3)\nLIMS/SAP QM: For test data, inspection plans, material master data. (USE CASE 1, USE CASE 3)\nEquipment Management (QC07): For equipment availability, status, and maintenance schedules. (QC01, USE CASE 1)\nStability Program Management: For planning stability tests. (USE CASE 1)",
    "pain_points": "Manual scheduling and planning processes with no central interface.\nLack of a First-In-First-Out (FIFO) principle adherence due to frequent changes.\nDisturbances caused by dependency on production schedules and ad-hoc changes.\nUnplanned activities (trainings, projects, system implementations) impacting schedules.\nNo possibility for long-term planning; no connection to production planning.\nFTE planning is primarily short-term.\nVolatile schedules due to manufacturing changes.\nNo standard system for planning & scheduling.\nMaster data creation process for planning is cumbersome, involving MDM and IU/Dev.\nHigh diversity in QC ordering systems, hindering standardization. (USE CASE 3)\n100% manual QC material ordering process with high effort. (USE CASE 3)\nManual creation of materials if not available in the system. (USE CASE 3)\nUncontrolled purchasing leading to higher costs. (USE CASE 3)\nLong material availability and delivery times. (USE CASE 3)\nUndefined and untraceable minimum stock levels. (USE CASE 3)\nManual effort to attach CoAs from suppliers. (USE CASE 3)"
  },
  {
    "bi_id": "PS-QC-002",
    "name": "SPECIFICATION CREATION AND HANDLING",
    "area_name": "Quality Control",
    "step_description": "This step establishes a strong foundation for quality control through automated, standardized, and globally unified procedures for creating and managing specifications. It involves centralized management, automated transfer, global inspection plans, and AI-powered tools for translation and procedure development.",
    "what_is_actually_done": "Develop and maintain a global system for all specifications and analytical procedures. Ensure centralized control with versioning, change tracking, and user access controls. Integrate with other enterprise systems (e.g., LIMS, LES) for real-time collaboration and updates. Harmonize procedures and limits cross-site and cross-product, with global standards in English. Manage updates through automated versioning and guided workflows (QC04 / USE CASE 4). Implement a system for automatically transferring specifications to subsequent systems (LIMS, LES). Ensure real-time synchronization, error detection, and customizable transfer rules. Automate the generation of inspection plans and workflows (for robotics, lab execution) from specifications. Establish governance to ensure global master data is changed only by authorized persons (QC05 / USE CASE 5). Establish a single, global master data setup for inspection plans per product. Standardize and harmonize plans and data structures across all sites. Define clear responsibilities for master data creation and maintenance (QC06 / USE CASE 8). Utilize AI to automatically translate documents (e.g., specifications, VQDs) while maintaining layout and formatting. Support multiple languages, use glossaries for context-specific terminology, and integrate with document management systems. Provide real-time translation previews and continuous learning for translation models (QC07 / USE CASE 6). Use an authoring tool with an easy front-end and structured back-end for creating analytical procedures. Enable automated \"transcription\" into other software solutions (LIMS testing plans, LES workflows). Support AI-assisted creation and standardization through building block-based authoring. Integrate IU (Innovation Unit) processes for co-creation of GMP-ready SOPs (QC08 / USE CASE 7).",
    "interfaces_text": "Lab Execution Systems (LES) / LIMS: For transferring specifications, inspection plans, and analytical procedures. (QC04, QC05, QC08)\nManufacturing Execution Systems (MES): If inspection plans or specifications are used directly in production-related checks.\nRegulatory Information Management Systems (RIMS): For managing specifications and handling regulatory changes. (QC05)\nChange Control Systems: For managing changes to specifications and ensuring compliance. (QC05)\nDocument Management Systems: For storing and retrieving original and translated documents. (QC07)\nInnovation Unit (IU) / R&D: For initial creation and handover of analytical procedures and specifications. (QC05, QC08)\nMaster Data Management (MDM): For global standards and governance. (QC04, QC06)\nRobotics Systems: For transferring automated workflows. (QC05)",
    "pain_points": "Design of analytical procedures does not always support automated workflow creation.\nRisk-based implementation of regulatory change controls is challenging.\nSiloed approach between IU and Operations for methods.\nLack of a global Control Test Specification (TS) for the same product.\nInefficient tracking of regulatory change controls.\nNo global standardization of methods and specifications, leading to n-methods and inefficiency.\nDifferent methods/specifications for the same products with no governance process.\nGSPECS system is complicated and not user-friendly, leading to high effort. (USE CASE 5)\nLack of automated recipe generation and inspection instruction. (USE CASE 5)\nUsers do not see the benefit of current specification systems (e.g., GSPECS). (USE CASE 5)\nEach site creates its own \"Prüfvorschrift\" (inspection instruction). (USE CASE 5)\nCurrent document translation is not high quality initially, requiring revision effort. (USE CASE 6)\nTranslation is time-consuming, variable in quality, and expensive. (USE CASE 6)\nTranslation step delays new project/system roll-outs. (USE CASE 6)\nMaster data setup for inspection plans is per site, leading to potential compliance risks if plans diverge. (USE CASE 8)\nChange management for inspection plans needed for every site separately. (USE CASE 8)"
  },
  {
    "bi_id": "PS-QC-003",
    "name": "SAMPLING AND SAMPLE STORAGE",
    "area_name": "Quality Control",
    "step_description": "This step involves the automated, traceable, and synchronized handling of sampling, sample handling, and storage activities. It aims for real-time visibility and efficient distribution, incorporating electronic documentation and production-lab integration.",
    "what_is_actually_done": "Implement an automated system (e.g., using RFID, barcodes, cameras) for tracking samples throughout their lifecycle. Provide real-time tracking, location updates (including digital localization in fridges), and alerts for sample movement/status. Ensure proper sample conditions with guided workflows and trigger warnings if handled/stored incorrectly. Integrate with lab and inventory systems (QC09 / USE CASE 12). Implement paperless, electronic documentation for all sampling events. Ensure digital logging of sampling events, real-time data entry and validation. Integrate with existing documentation systems (SAP QM, MES) for secure storage and easy retrieval. Document all information on how a sample is handled, including temperature control and other live data (QC10 / USE CASE 11). Utilize automated storage systems to efficiently manage large volumes of samples. Implement intelligent storage with temperature and humidity control. Ensure storage is locked and accessible only with digital authorization (e.g., card reader) (QC11 / USE CASE 13). Develop a seamless interface between production (MES) and lab software (LIMS/SAP QM). Automate the process of sending samples for analysis, including sample transfer from production to lab. Enable real-time data synchronization, including sample status ('Live-Tracking' of Batch) and IPC result transfer. Support sampling/labeling in MES with data transfer to LIMS (QC12 / USE CASE 10).",
    "interfaces_text": "Manufacturing Execution Systems (MES) / Production: For initiating sampling, sample labeling, and receiving sample status/IPC results. (QC10, QC12)\nLaboratory Information Management Systems (LIMS) / SAP QM: For receiving sample data, managing test orders, and storing sampling documentation. (QC10, QC12)\nInventory Management Systems: For tracking sample locations and quantities. (QC09)\nEquipment Management (QC07): For ensuring availability of sampling equipment.\nTesting Preparation and Execution (QC04): For handover of samples for testing.\nAsset Administration Shell: For live-tracking of batch status. (USE CASE 10)",
    "pain_points": "No clear approach for sample handover.\nDifficulties in reconciliation of samples.\nUnclear documentation location for sampling (Production vs. QC).\nLack of sample tracking, especially for temperature-controlled samples.\nManual paper-based and copy/paste processes for sampling documentation.\nSampling and labeling in MES, but data transfer to/from LIMS is problematic.\nDifficulty identifying samples in freezers.\nInadequate sample tracking from sampling until disposal.\nOperator needs to switch between multiple systems (and learn them).\nSampling documentation is often paper-based (SDI).\nQualification of sample takers needs to be verifiable by QC.\nDifferent UIs for several software systems, high training effort, system breaks. (USE CASE 10)\nAccess for sample takers to SAP/QM often not given. (USE CASE 11)\nData integrity issues due to system breaks in manual data transfer. (USE CASE 11)"
  },
  {
    "bi_id": "PS-QC-004",
    "name": "TESTING PREPARATION AND EXECUTION",
    "area_name": "Quality Control",
    "step_description": "This step covers the automation or guidance of lab operations through digital workflows, following standardized methods with review by exception. It includes preparation of samples and reagents, execution of analytical procedures, and integration of various systems and data sources.",
    "what_is_actually_done": "Implement a unified Lab Execution System (LES) with guided, system-based instructions (recipes) for test preparation and execution. Provide harmonized global recipes (e.g., Lab4U for AMET) and standardized preparation templates. Offer a user-friendly, harmonized UI independent of underlying tools/EQs, displaying necessary settings and step-by-step worker assistance. Connect with all equipment software solutions for online checks and system-supported deviation detection. Enable digital guided workflows with review by exception (QC13 / USE CASE 14). Automate sample preparation (stock solutions, solvents, mobile phases, pipetting) and testing execution using robotics and advanced automation. Utilize modular, repository-based robotics solutions with workflows derived from testing specifications. Integrate with laboratory management systems for seamless operation and activity feedback to planning/scheduling. Implement automated visual inspection (QC14 / USE CASE 15). Automatically generate quality event documentation (OOS, discrepancies) during the QC process step. Utilize AI for QC data processing, automated OOS/discrepancy detection, and real-time alerts. Connect deviation tools (e.g., GoTrack) to LIMS and other systems for automated event creation and data transfer. Link deviation information/reports to batch/lab documentation (QC15 / USE CASE 18). Increase in-line testing and leverage production process data to reduce or eliminate traditional In-Process Controls (IPCs). Integrate with manufacturing systems for actual drawing of samples for in-line tests (QC16 / USE CASE 20). Implement automated systems for storing and managing compounds (chemicals, columns). Utilize a digital tool with harmonized master data to manage reagents. Link to order management (process step 1) for automated ordering based on stock and needs (QC17 / USE CASE 17). Automate the transfer of data from suppliers (e.g., CoA via XML import files, scan with text recognition) into internal systems (e.g., SAP QM). Reduce manual effort in transferring supplier information (QC18 / USE CASE 19). Ensure seamless, vertical E2E integration of all layers (ERP/LIMS/AMET/VSIMS/Software/Equipment). Eliminate manual data transfer and system interfaces to ensure data integrity and reduce effort. Provide interfaces to pre/subsequent systems (QC19 / USE CASE 16).",
    "interfaces_text": "Lab Planning and Scheduling (QC01): For receiving test orders and providing feedback on test execution status. (QC14)\nSpecification Creation and Handling (QC02): For receiving test methods and specifications. (QC14)\nSampling and Sample Storage (QC03): For receiving samples.\nResult Generation, Evaluation & Release (QC05): For forwarding raw data and test execution records.\nLIMS/LES/AMET: Central to test execution, data capture, and workflow management. (QC13, QC14, QC19)\nERP (e.g., SAP QM): For master data, batch information, and potentially inventory management. (QC17, QC18, QC19)\nEquipment/Instruments: Direct connection for control and data acquisition. (QC13, QC19)\nManufacturing Systems (MES/PCS): For in-line testing data and sample draw. (QC16)\nProcurement/Order Management (QC01): For reagent and compound inventory management and ordering. (QC17)\nSupplier Systems: For CoA and other data. (QC18)\nDeviation Management Systems (e.g., GoTrack): For automated event creation. (QC15)",
    "pain_points": "Testing Preparation:\nLabs buying reagents themselves without central control.\nEvery lab can order what they want, leading to variability.\nWorkflow creation for execution systems is manual and time-consuming.\nMultiple (e.g., ~10) systems to handle for end-users.\nMany different systems and UIs for end-users.\nManual naming conventions.\nTesting Execution:\nRedundant testing methods due to small deviations.\nNeed to set up the same master data at different sites.\nPaper-based assay documentation.\nMany different software solutions/UIs.\nRedundant systems, high complexity, and costs.\nOld test execution methods that are time-consuming (e.g., overnight).\nLack of interfaces between LIMS and lab systems (e.g., LabX, Omnis).\nWorkflow creation for execution systems is manual and time-consuming.\nLargely non-automated test execution (old methods, no NIR).\nHigh system complexity for testing, lack of overview.\nMany different logins needed, consuming time.\nProblematic data transfer between lab systems.\nGeneral:\nNo data connection, no manual data transfer (for Connected Systems - QC19 / USE CASE 16).\nReagent and stock management done manually per lab, not based on planned needs (for Automated Storage - QC17 / USE CASE 17).\nManual creation of quality events and manual data transfer to GoTrack. (QC15 / USE CASE 18)\nGoTrack UI not user-friendly. (QC15 / USE CASE 18)\nEvent data incomplete or with failures (audit findings). (QC15 / USE CASE 18)\nReal-time creation of events is often an issue. (QC15 / USE CASE 18)\nHigh effort in transferring information from suppliers. (QC18 / USE CASE 19)"
  },
  {
    "bi_id": "PS-QC-005",
    "name": "RESULT GENERATION, EVALUATION & RELEASE",
    "area_name": "Quality Control",
    "step_description": "This step uses AI-supported evaluation and automated review by exception to ensure efficient and accurate results. It involves automated result generation, reporting, and release processes, with guided workflows where necessary.",
    "what_is_actually_done": "Automate the comparison of analytical results and executed steps against limits and procedures. Require manual review/approval by compliance teams only in case of exceptions (OOS, deviations, pattern violations). Utilize AI-based batch simulation to potentially reduce the number of quality tests. Integrate with compliance management systems for automated checks and notifications (QC20 / USE CASE 22). Implement a \"one-button\" batch release or a batch release cockpit with interfaces to all source systems. Automate SAP QM usage decisions. Provide real-time QC dashboards for status, automated checks and validations of results and test status. Automate plausibility checks of analytical results and raw data. Generate harmonized CoA automatically (QC21 / USE CASE 21). Automate QC result generation (data processing, calculation) and evaluation against predefined limits. Process raw data automatically through different layers. Consider the whole analytical panel of a product for evaluation. Transfer results automatically from source systems into LIMS. Use AI/machine learning for pattern evaluation. Provide standardized QC result reports and automated notifications (QC22 / USE CASE 23). Implement automated, step-by-step workflows for QC review and release if \"review by exception\" is not fully in place. Digitalize paper checklists. Automate task assignments, tracking, and compliance checks for GxP data. Integrate with QC management systems (QC23 / USE CASE 25).",
    "interfaces_text": "Testing Preparation and Execution (QC04): For receiving raw data and test records.\nSpecification Creation and Handling (QC02): For specifications and limits.\nLIMS/LES/AMET: For accessing results, methods, and managing release status. (QC20, QC21, QC22)\nERP (e.g., SAP QM): For usage decisions and batch release. (QC21)\nData Analytics Platforms (QC06): For providing data for trending and receiving insights that might influence release decisions.\nDocument Management Systems: For storing CoAs and release documentation. (QC21)\nCompliance Management Systems: For automated compliance checks. (QC20, QC23)\nQuality Assurance (QA): For final batch disposition after QC release.",
    "pain_points": "Functionalities of existing systems are not equally adopted.\nManual comparison of test results against ranges (at some sites).\nQC KPIs are manually created, heterogeneous, leading to a lack of actionability.\nNo common understanding of Out of Specification (OoS).\nMissing interface to the LIMS layer, leading to manual data transfer and high review effort (time, money).\nNo automated comparison against specifications/limits.\nLack of governance (should be 1 product, 1 standard).\nVendor software is not user-friendly, outdated, and buggy.\nData Integrity (DI) gaps in standard solutions from instrument suppliers.\nMany manual checks creating high effort for QC release. (USE CASE 21)\nVery difficult to check all data in all systems for release. (USE CASE 21)\nRisk of human error in manual checks. (USE CASE 21)\nPlausibility checks are high effort and complex. (USE CASE 21)\nManual checks, multiple review and approval steps. (USE CASE 22)"
  },
  {
    "bi_id": "PS-QC-006",
    "name": "QC DATA ANALYSIS AND TRENDING",
    "area_name": "Quality Control",
    "step_description": "This step employs a user-centric framework for continuous and automated QC data analysis. It uses AI to identify patterns across the analytical panel, supporting predictive analytics, trending of both analytical and non-analytical data, and informed decision-making.",
    "what_is_actually_done": "Automatically link analytical data to predefined trending scenarios. Reduce manual steps currently performed in systems like GDTS (e.g., mapping). Serve as a prerequisite for predictive analytics (QC24 / USE CASE 27). Use predictive analytics to identify potential quality issues before they occur (proactive measures). Employ AI for correlating analytical results within a batch or across multiple batches of a product. Utilize AI for identifying trends, patterns, shifts, and for health checks of methods/equipment/labs. Support real-time trending based on actual data. Enable AI-assisted automated trending, report generation (CPV, PQR, MQR), and self-service analytics on GxP validated QC data pools (QC25 / USE CASE 26). Automate the trending and evaluation of available lab data (e.g., discrepancies, equipment availability) using AI. Provide timely notifications if patterns arise. Automatically assess products (SCRA), suppliers (Purchasing Assessments, RQA), etc., using this non-analytical data. Implement a unified trending approach for all quality events, including report generation (QC26 / USE CASE 28).",
    "interfaces_text": "Result Generation, Evaluation & Release (QC05): For sourcing QC analytical data.\nLIMS/LES/ERP (SAP QM): Primary sources for analytical and operational QC data.\nQuality Event Systems (e.g., GoTrack, SCRA, RQA): For non-analytical data like deviations, supplier assessments. (QC26)\nManufacturing Systems (MES): For process parameters that might be correlated with QC trends.\nEquipment Management Systems (QC07): For equipment availability and maintenance data. (QC26)\nManagement Reporting Systems / BI Platforms: For disseminating trend reports and dashboards. (QC25)\nQuality Assurance (QA): For insights into product quality, process stability, and CAPA effectiveness.",
    "pain_points": "No clear vision for trending; scattered approaches are used.\nAll trending activities involve many manual steps.\nNo connection of all equipment to systems; still relying on logbooks and several disparate systems.\nIt's not clear what should be shown with trending.\nTrending is done in multiple systems with a lot of manual steps.\nSystems are not user-friendly for data analysis.\nGetting data easily is not possible; a lot of manual work is involved.\nSix to seven different trending reports that still don't provide a holistic picture.\nNo connection/interface to equipment to have data ready for monitoring/long-term overview.\nOnly partial integration of equipment into a \"data lake.\"\nKPIs are measured but not used; no common QC KPIs.\nCMO data: Client responsibility, not all data governed by BI.\nManual data trending, no central governance, or overarching guidance.\nEven for critical attributes, global solutions are not available in a user-friendly way.\nManual steps in GDTS (e.g., mapping) for linking data to trending scenarios. (USE CASE 27)"
  },
  {
    "bi_id": "PS-QC-007",
    "name": "QC EQUIPMENT READINESS",
    "area_name": "Quality Control",
    "step_description": "This step ensures that standardized lab equipment is fully connected and operational. It focuses on having transparency on equipment-related data and status through unified management systems, global purchasing standards, automated reviews, and optimized digital maintenance.",
    "what_is_actually_done": "Maintain a comprehensive digital database and logbook (e.g., SAP PM) for all equipment data (qualifications, calibrations, daily checks, history, maintenance, status). Provide a centralized equipment data repository with a traffic light system for current status. Block equipment usage if not ready. Optimize maintenance activities based on use cycles/historical data (AI-based). Enrich metadata in SAP/PM for harmonization (QC27 / USE CASE 31). Establish and govern global standards for lab equipment catalogue, assets tracking, purchase, replacement, and Capex planning. Implement process/system control points to check purchases against the standard equipment catalogue. Focus on standardized equipment across all sites (QC28 / USE CASE 32). Automate (or semi-automate initially) the periodic review for computer systems, equipment, methods, validation, and Excel files. Ensure the review considers all relevant data (events, deviations, changes, SLC docs). Evaluate for negative trends (QC29 / USE CASE 35). Use IoT for equipment connectivity, enabling real-time monitoring and data collection. Implement predictive maintenance, supported by AI, based on available data and usage. Predict equipment failures proactively. Flexibly connect EQs and solutions in a standardized way via an architectural connectivity layer (QC30 / USE CASE 34). Implement digital equipment logbooks interfaced with LIMS, Trackwise, etc. Digitalize paper checklists for lab equipment maintenance. Make all system-related tasks and statuses visible and checked by electronic systems (no stickers except ID on equipment). Enable paperless documentation and logbook entries for maintenance, with connected systems and mobile maintenance capabilities. Use predictive models (AI-driven) to forecast maintenance needs and enable proactive scheduling (QC31 / USE CASE 33). Establish a harmonized and centralized organization for QC maintenance activities, potentially starting semi-automated (USE CASE 36).",
    "interfaces_text": "Lab Planning and Scheduling (QC01): To provide equipment availability and status for planning. (QC27)\nTesting Preparation and Execution (QC04): To ensure equipment is ready for use and to block usage if not. (QC27)\nProcurement/Finance: For Capex planning, purchasing, and supplier management. (QC28)\nLIMS/Trackwise: For interfacing digital logbooks and maintenance data. (QC31)\nSAP PM: As a potential central system for equipment management and maintenance. (QC27, QC31)\nIT Systems: For IoT connectivity and data platforms. (QC30)\nValidation Departments: For periodic reviews of validated systems/methods. (QC29)\nExternal Suppliers/Maintenance Providers: For maintenance activities and data handover. (QC27)",
    "pain_points": "Equipment is not standardized.\nDifferent equipment from different vendors requires multiple systems.\nDifferent, non-standardized procedures for calibration and set-up of equipment.\nNo transparency on equipment status.\nNo central equipment inventory (status, calibration, etc.).\nManual periodic review for lab equipment.\nNo (physical) equipment standards.\nNo global (protocol) standard for equipment set-up.\nNo lab equipment database (e.g., available equipment in my lab).\nNo electronic handover of documentation from supplier to BI.\nBusiness process for usage of SAP/PM not globally standardized.\nGxP logbook for computerized systems (IT, Business, etc.) frontend not user-friendly.\nEquipment information is not available in a harmonized, transparent system. (USE CASE 31)\nInformation required for planning lab activities, maintenance, etc., is time-consuming to obtain. (USE CASE 31)\nNo strong central governance on equipment purchases by sites against global standard catalogue. (USE CASE 32)\nPotential for lost/mis-allocated Capex investments due to non-standard equipment purchases. (USE CASE 32)\nMaintenance documentation is often paper-based. (QC31 / USE CASE 33)"
  }
]